[
    {
        "q": "What does SUID permission mean on a Linux file?",
        "o": [
            "File executes with owner privileges regardless of who runs it",
            "File can only be read by the superuser on the system now",
            "File is encrypted and requires special decryption keys here",
            "File automatically runs at system startup as daemon process"
        ]
    },
    {
        "q": "How do you find SUID binaries on a Linux system?",
        "o": [
            "Use find command with -perm -4000 option to locate SUID files",
            "Use ls -la command to list all SUID files in the filesystem",
            "Check the /etc/suid directory which lists all SUID binaries",
            "Run suidcheck utility that is installed by default on Linux"
        ]
    },
    {
        "q": "What does SGID permission enable on executable files?",
        "o": [
            "File executes with the group privileges of the file owner",
            "File can only be modified by members of the admin group here",
            "File shares data between all users in the same group always",
            "File generates a log entry for every group member access now"
        ]
    },
    {
        "q": "What is the sticky bit permission on directories?",
        "o": [
            "Only file owner or root can delete files within directory",
            "Directory contents are hidden from non-owner user accounts",
            "Files in directory are automatically backed up to storage",
            "Directory is marked for deletion on next system reboot here"
        ]
    },
    {
        "q": "Which file contains user account information on Linux?",
        "o": [
            "The /etc/passwd file stores user account information",
            "The /var/users file stores all user account data here",
            "The /home/users.db database contains account information",
            "The /root/accounts file maintains user account records"
        ]
    },
    {
        "q": "Where are password hashes typically stored on modern Linux?",
        "o": [
            "Password hashes are stored in /etc/shadow file for security",
            "Password hashes are stored in /etc/passwd visible to all users",
            "Password hashes are kept in /var/auth/passwords on the system",
            "Password hashes reside in /home/.hashes for each user account"
        ]
    },
    {
        "q": "What is the purpose of the /etc/sudoers file?",
        "o": [
            "Defines which users can run commands with elevated privileges",
            "Contains list of users who are banned from using the system",
            "Stores encrypted passwords for all administrative accounts here",
            "Lists all commands that require network connectivity to execute"
        ]
    },
    {
        "q": "What command shows your current user privileges on Linux?",
        "o": [
            "The id command displays user and group membership information",
            "The whoami command shows all privileges for current user here",
            "The priv command lists privilege levels assigned to user now",
            "The rights command displays access control list for the user"
        ]
    },
    {
        "q": "What is a common method to check sudo permissions?",
        "o": [
            "Running sudo -l lists commands the user can run with sudo",
            "Checking /etc/sudoers directly shows all user permissions now",
            "Using sudocheck command displays available privilege levels",
            "Viewing ~/.sudo file reveals allowed commands for the user"
        ]
    },
    {
        "q": "What kernel information is useful for privilege escalation?",
        "o": [
            "Kernel version helps identify known exploits for escalation",
            "Kernel color indicates security level of the running system",
            "Kernel source reveals root password for emergency access here",
            "Kernel modules list shows all installed backdoors on system"
        ]
    },
    {
        "q": "What command shows the Linux kernel version?",
        "o": [
            "The uname -r command displays the kernel version information",
            "The version command shows kernel and system version details",
            "The kerninfo command reveals detailed kernel specifications",
            "The sysver command outputs the complete kernel version data"
        ]
    },
    {
        "q": "What is the purpose of enumeration in privilege escalation?",
        "o": [
            "Gathering system information to identify escalation vectors",
            "Removing all traces of unauthorized access from log files",
            "Installing backdoors for persistent access to the system here",
            "Encrypting sensitive data before exfiltration to attackers"
        ]
    },
    {
        "q": "What does the /etc/crontab file contain?",
        "o": [
            "System-wide scheduled tasks that run at specified intervals",
            "List of users allowed to use cron functionality on system",
            "Backup schedule for system files to remote storage location",
            "Network connections that should be established at boot time"
        ]
    },
    {
        "q": "Why are cron jobs interesting for privilege escalation?",
        "o": [
            "Cron jobs may run scripts as root that can be modified now",
            "Cron logs contain passwords in plaintext for debugging use",
            "Cron configuration files are always world-writable by design",
            "Cron service runs with reduced privileges making it safer"
        ]
    },
    {
        "q": "What is a wildcard injection attack in Linux?",
        "o": [
            "Exploiting how wildcards expand in scripts to inject commands",
            "Using special characters to bypass password authentication now",
            "Injecting malicious code through wildcard SSL certificates here",
            "Overwriting system files using asterisk in filename patterns"
        ]
    },
    {
        "q": "What are Linux capabilities in security context?",
        "o": [
            "Fine-grained privileges that replace the all-or-nothing root",
            "Encryption capabilities of the kernel for secure communication",
            "Maximum file size limits imposed on user accounts by system",
            "Network bandwidth restrictions for different user categories"
        ]
    },
    {
        "q": "Which command lists capabilities of a binary?",
        "o": [
            "The getcap command shows capabilities assigned to binaries",
            "The lscap command lists all capability settings for files",
            "The caplist command displays binary capability assignments",
            "The showcaps command reveals file capability attributes now"
        ]
    },
    {
        "q": "What is CAP_SETUID capability used for?",
        "o": [
            "Allows a process to change its user ID to any other user",
            "Enables a process to set unique identifiers for new files",
            "Permits a process to set up network interfaces on system",
            "Allows a process to create setuid executables on filesystem"
        ]
    },
    {
        "q": "What NFS misconfiguration enables privilege escalation?",
        "o": [
            "NFS shares exported with no_root_squash allow root access",
            "NFS shares with read permissions allow writing any files",
            "NFS servers without authentication expose the entire disk",
            "NFS mounts with compression enabled leak sensitive data now"
        ]
    },
    {
        "q": "What does no_root_squash mean in NFS exports?",
        "o": [
            "Remote root user keeps root privileges on the NFS share",
            "Root directory is not included in the exported share path",
            "Squashing algorithm is disabled reducing compression ratio",
            "Root password is not required to mount the NFS share now"
        ]
    },
    {
        "q": "What is PATH hijacking in Linux?",
        "o": [
            "Manipulating PATH to execute malicious binary instead of real",
            "Changing network routes to intercept traffic between hosts",
            "Modifying filesystem paths to hide files from administrators",
            "Altering log paths to prevent security event recording now"
        ]
    },
    {
        "q": "How can writable /etc/passwd lead to privilege escalation?",
        "o": [
            "Adding new user entry with root privileges or UID zero here",
            "Reading password hashes for offline cracking attacks on users",
            "Deleting log entries that record unauthorized access attempts",
            "Modifying user shell to execute malicious code at login time"
        ]
    },
    {
        "q": "What is a common privilege escalation via sudo misconfiguration?",
        "o": [
            "Sudo allowing commands that can spawn shells or write files",
            "Sudo requiring password which can be brute forced easily now",
            "Sudo logging all commands to files readable by all users here",
            "Sudo timeout being too long allowing session hijacking attacks"
        ]
    },
    {
        "q": "Which GTFOBins provides shell escape sequences?",
        "o": [
            "GTFOBins documents binaries that can be abused for escalation",
            "GTFOBins contains kernel exploits for privilege escalation now",
            "GTFOBins lists vulnerable network services on Linux systems",
            "GTFOBins stores password wordlists for dictionary attacks here"
        ]
    },
    {
        "q": "What is LD_PRELOAD privilege escalation?",
        "o": [
            "Loading malicious library before others when running SUID binary",
            "Preloading disk encryption keys for faster system boot time",
            "Downloading kernel updates before they are officially released",
            "Loading network driver before establishing connection to server"
        ]
    },
    {
        "q": "Why check for world-writable files during enumeration?",
        "o": [
            "World-writable files might be executed by privileged processes",
            "World-writable files always contain sensitive configuration data",
            "World-writable files are automatically backed up by the system",
            "World-writable files indicate the system has been compromised"
        ]
    },
    {
        "q": "What is the significance of /tmp directory in attacks?",
        "o": [
            "World-writable directory often used for staging exploit files",
            "Temporary directory that is cleared on every user login event",
            "System directory containing temporary administrator passwords",
            "Directory where all security logs are temporarily stored now"
        ]
    },
    {
        "q": "What does the find command option -perm -2000 locate?",
        "o": [
            "Files with SGID permission set on the filesystem location",
            "Files modified in the last 2000 seconds on the filesystem",
            "Files larger than 2000 bytes stored on the current volume",
            "Files owned by user ID 2000 across the entire filesystem"
        ]
    },
    {
        "q": "What is a kernel exploit in privilege escalation context?",
        "o": [
            "Exploiting vulnerability in kernel to gain root privileges now",
            "Updating kernel to remove security patches from the system",
            "Compiling custom kernel with backdoor for persistent access",
            "Disabling kernel security features through configuration file"
        ]
    },
    {
        "q": "What is Dirty COW vulnerability?",
        "o": [
            "Race condition in kernel allowing write to read-only memory",
            "Memory corruption bug that crashes system on exploitation",
            "Network vulnerability allowing remote code execution as root",
            "Filesystem bug that corrupts data when accessed concurrently"
        ]
    },
    {
        "q": "What should you check in /etc/exports file?",
        "o": [
            "NFS share configurations that might allow root access to files",
            "List of users who are allowed to export files from system",
            "Export encryption keys for data protection during transfers",
            "Configuration of export restrictions for outgoing connections"
        ]
    },
    {
        "q": "How can environment variables lead to escalation?",
        "o": [
            "Malicious values in variables used by privileged programs now",
            "Environment variables always contain root password in Linux",
            "Variables can disable all security features on the system",
            "Environment stores encryption keys accessible to all users"
        ]
    },
    {
        "q": "What is the purpose of checking running processes?",
        "o": [
            "Identify services running as root that might be exploitable",
            "Count total processes to determine system resource usage now",
            "Find processes that are consuming too much memory on system",
            "List all users currently logged into the system for audit"
        ]
    },
    {
        "q": "What command shows processes running as root?",
        "o": [
            "The ps aux command combined with grep for root shows them all",
            "The rootps command lists all root processes automatically now",
            "The procroot command displays root process information here",
            "The lsroot command shows all processes owned by root user"
        ]
    },
    {
        "q": "What is a common Docker privilege escalation vector?",
        "o": [
            "Membership in docker group allows container with root access",
            "Docker containers automatically run as root user on host now",
            "Docker daemon always exposes root credentials in log files",
            "Docker images contain default passwords for root accounts"
        ]
    },
    {
        "q": "What does LXC/LXD group membership enable?",
        "o": [
            "Creating privileged containers that can access host filesystem",
            "Running lightweight applications with reduced system access",
            "Managing user accounts across multiple Linux containers now",
            "Configuring network isolation between container instances"
        ]
    },
    {
        "q": "What is the purpose of checking installed packages?",
        "o": [
            "Identify vulnerable software versions that can be exploited",
            "Count installed packages to determine disk space usage now",
            "Find packages that require updates for stability reasons",
            "List packages installed after initial system setup time"
        ]
    },
    {
        "q": "What does SSH key misconfiguration enable?",
        "o": [
            "Private keys in readable locations can provide user access",
            "SSH configurations always expose root password in plaintext",
            "Key files contain encryption backdoors for system access now",
            "SSH service runs with elevated privileges by default on Linux"
        ]
    },
    {
        "q": "Where are user cron jobs typically located?",
        "o": [
            "User cron jobs are stored in /var/spool/cron/crontabs directory",
            "User cron jobs are in ~/.cron directory in home folder now",
            "User cron jobs reside in /etc/cron.user configuration file",
            "User cron jobs are stored in /home/cron for all users here"
        ]
    },
    {
        "q": "What is the significance of checking history files?",
        "o": [
            "History files may contain passwords or sensitive commands typed",
            "History files always store encrypted versions of all passwords",
            "History files contain system logs for security audit purposes",
            "History files record network connections for forensic analysis"
        ]
    },
    {
        "q": "What is an interesting file to check in user home directories?",
        "o": [
            "The .bash_history file may contain sensitive information now",
            "The .secure file stores user encryption keys for all files",
            "The .admin file grants administrative privileges when present",
            "The .root file indicates the user has root access to system"
        ]
    },
    {
        "q": "Why enumerate network connections during escalation?",
        "o": [
            "Find internal services that might be exploitable for escalation",
            "Count network connections to measure bandwidth consumption now",
            "Identify external attackers currently connected to the system",
            "List blocked connections that were denied by firewall rules"
        ]
    },
    {
        "q": "What command shows listening network services?",
        "o": [
            "The netstat -tulpn or ss -tulpn shows listening services now",
            "The listen command displays all services awaiting connections",
            "The services command lists network services in listen state",
            "The lsnet command shows listening network service information"
        ]
    },
    {
        "q": "What is the purpose of MySQL with root running?",
        "o": [
            "MySQL running as root can be exploited to write system files",
            "MySQL always requires root to function properly on Linux now",
            "MySQL root indicates database administrator account is active",
            "MySQL with root means database is storing system passwords"
        ]
    },
    {
        "q": "What is User Defined Function escalation in MySQL?",
        "o": [
            "Creating function that executes system commands as database user",
            "Defining custom functions for better database query performance",
            "User functions that allow reading data without authentication",
            "Functions that bypass access controls in database systems now"
        ]
    },
    {
        "q": "What file permission allows anyone to read a file?",
        "o": [
            "The world-readable permission indicated by r in others field",
            "The readable permission marked by capital R in listing output",
            "The group read permission expressed by g+r in permissions now",
            "The universal permission shown by asterisk in file listing"
        ]
    },
    {
        "q": "What is the numeric value for SUID permission?",
        "o": [
            "The SUID bit is represented by 4000 in numeric permissions now",
            "The SUID bit uses value 1000 in octal permission notation here",
            "The SUID permission is expressed as 2000 in numeric format now",
            "The SUID bit corresponds to 0400 in standard permission mode"
        ]
    },
    {
        "q": "What does the chmod command modify?",
        "o": [
            "The chmod command changes file permission bits on filesystem",
            "The chmod command modifies file ownership to different user",
            "The chmod command changes modification time of files on disk",
            "The chmod command updates file checksum for integrity check"
        ]
    },
    {
        "q": "What umask value creates most permissive file permissions?",
        "o": [
            "A umask of 000 creates files with most permissive settings",
            "A umask of 777 creates files accessible to all users system",
            "A umask of 111 allows all users to execute created files now",
            "A umask of 666 creates world-readable files by default here"
        ]
    },
    {
        "q": "What is the purpose of the wheel group?",
        "o": [
            "Members of wheel group are allowed to use su command to root",
            "Wheel group manages disk partitioning on the Linux system now",
            "The wheel group controls mouse input for graphical interface",
            "Wheel group members can spin up new virtual machines on host"
        ]
    },
    {
        "q": "What does the su command do?",
        "o": [
            "The su command allows switching to another user account now",
            "The su command shows system usage statistics for current user",
            "The su command suspends current user session temporarily here",
            "The su command sets up new user accounts on the system now"
        ]
    },
    {
        "q": "What is the difference between su and sudo?",
        "o": [
            "Su switches user while sudo runs single command as other user",
            "Su is for network access while sudo is for local commands only",
            "Su requires graphical interface while sudo works in terminal",
            "Su is deprecated and sudo should always be used instead now"
        ]
    },
    {
        "q": "What is a relative path vulnerability?",
        "o": [
            "Program using relative path can be hijacked via PATH manipulation",
            "Vulnerability in programs that store paths in relative format",
            "Attack on file relations between parent and child directories",
            "Exploit targeting relative file permissions on the filesystem"
        ]
    },
    {
        "q": "Why check for backup files during enumeration?",
        "o": [
            "Backup files may contain sensitive information like passwords",
            "Backup files always contain root credentials for recovery now",
            "Backup files indicate system has been compromised previously",
            "Backup files store encryption keys for the entire filesystem"
        ]
    },
    {
        "q": "What extension often indicates backup files?",
        "o": [
            "Extensions like .bak .backup and .old indicate backup files",
            "Extensions like .sec .secure indicate backup file locations",
            "Extensions like .tmp .temp are used for backup files only now",
            "Extensions like .new .latest indicate backup file versions"
        ]
    },
    {
        "q": "What is the purpose of LinPEAS script?",
        "o": [
            "Automated enumeration script for privilege escalation vectors",
            "Linux patch and enhancement automatic system update utility",
            "Password encryption and authentication service for Linux now",
            "Performance evaluation and system benchmark tool for Linux"
        ]
    },
    {
        "q": "What does LinEnum script automate?",
        "o": [
            "Enumerates system information for privilege escalation checks",
            "Automatically patches known vulnerabilities on Linux systems",
            "Lists all encrypted files on the filesystem for decryption",
            "Numerical analysis of system performance metrics over time"
        ]
    },
    {
        "q": "What is the purpose of checking mount options?",
        "o": [
            "Mount options like nosuid or noexec affect exploitation now",
            "Mount options contain passwords for encrypted filesystems here",
            "Mount options show network shares available for access on disk",
            "Mount options indicate disk health and remaining storage space"
        ]
    },
    {
        "q": "What does the noexec mount option do?",
        "o": [
            "Prevents execution of binaries from the mounted filesystem now",
            "Blocks exclusive access to files on the mounted partition here",
            "Disables existence checks for files on the mounted volume now",
            "Removes execution permission from all files on the filesystem"
        ]
    },
    {
        "q": "What does the nosuid mount option prevent?",
        "o": [
            "Prevents SUID and SGID bits from having effect on the mount",
            "Blocks saving of unique identifiers on the mounted filesystem",
            "Disables user identification for files on mounted partition",
            "Removes storage of user data on the mounted volume entirely"
        ]
    },
    {
        "q": "What is a readable shadow file vulnerability?",
        "o": [
            "Readable /etc/shadow allows extraction of password hashes now",
            "Shadow files always contain plaintext passwords for recovery",
            "Shadow vulnerabilities enable network interception attacks here",
            "Readable shadows indicate system uses deprecated authentication"
        ]
    },
    {
        "q": "What tool cracks password hashes on Linux?",
        "o": [
            "John the Ripper is commonly used to crack password hashes now",
            "Linux Cracker is the built-in tool for hash analysis on system",
            "HashBreak utility decrypts all password hashes automatically",
            "PassCrack service cracks hashes using cloud computing power"
        ]
    },
    {
        "q": "What is the purpose of checking for configuration files?",
        "o": [
            "Config files may contain plaintext credentials or sensitive data",
            "Configuration always includes root password for recovery access",
            "Config files store kernel exploits for privilege escalation here",
            "Configuration files contain backdoor activation codes for system"
        ]
    },
    {
        "q": "Which service commonly stores credentials in config files?",
        "o": [
            "Database services often have credentials in configuration files",
            "SSH service stores all passwords in its config by default now",
            "Web services always save admin passwords in config files here",
            "System services store root credentials in config for recovery"
        ]
    },
    {
        "q": "What is a symlink attack in Linux?",
        "o": [
            "Creating symbolic link to redirect writes to protected files now",
            "Attack that breaks symbolic links to cause system instability",
            "Injecting malicious code through symbolic link file contents",
            "Encrypting symbolic links to prevent file access on system"
        ]
    },
    {
        "q": "What does the locate command do?",
        "o": [
            "Searches database for files matching pattern quickly on system",
            "Tracks geographic location of the system using network info",
            "Locates available disk space on all mounted filesystems now",
            "Finds connected devices and their location in device tree"
        ]
    },
    {
        "q": "Why might /opt directory contain interesting files?",
        "o": [
            "Optional software in /opt may have misconfigurations or secrets",
            "Opt directory always contains optimized kernel modules here",
            "Optional directory stores operation logs for all services now",
            "Opt contains temporary files that are deleted on reboot"
        ]
    },
    {
        "q": "What is the purpose of checking webroot directories?",
        "o": [
            "Web applications may contain credentials in config files now",
            "Webroot always contains admin passwords for web application",
            "Web directories store kernel exploits for privilege escalation",
            "Webroot has backup of entire system for disaster recovery"
        ]
    },
    {
        "q": "What is a common webserver configuration file to check?",
        "o": [
            "Files like wp-config.php contain database credentials often",
            "Web.secure files store all admin passwords for web services",
            "Apache.key contains encryption keys for all web traffic now",
            "Nginx.pass stores passwords for all configured virtual hosts"
        ]
    },
    {
        "q": "What does the lsattr command show?",
        "o": [
            "Lists extended file attributes like immutable flag settings now",
            "Shows last access time for all files in directory listing here",
            "Lists attached storage devices and their mount locations now",
            "Displays all attributes of logged in users on the system"
        ]
    },
    {
        "q": "What is the immutable attribute on Linux files?",
        "o": [
            "File cannot be modified or deleted even by root user account",
            "File is encrypted with immutable key that cannot be changed",
            "File has permanent location on disk preventing fragmentation",
            "File exists forever and is excluded from backup operations"
        ]
    },
    {
        "q": "What is the chattr command used for?",
        "o": [
            "Changes extended file attributes like immutable flag setting",
            "Changes file attributes for data transfer protocols on network",
            "Changes chat settings for user communication on the system",
            "Changes attachment handling for email processing services"
        ]
    },
    {
        "q": "What is a race condition vulnerability?",
        "o": [
            "Bug where outcome depends on timing allowing exploitation now",
            "Condition where CPU processes race for memory access priority",
            "Vulnerability in startup sequence of racing services on system",
            "Attack that races to complete before security checks are done"
        ]
    },
    {
        "q": "What is TOCTOU vulnerability?",
        "o": [
            "Time of check to time of use race condition vulnerability now",
            "Total count of unauthorized access attempts on the system here",
            "Technique of continuous testing of user authentication state",
            "Time out condition for unused terminal sessions on system"
        ]
    },
    {
        "q": "What does dmesg command output?",
        "o": [
            "Kernel ring buffer messages including driver and boot information",
            "Digital message system logs for all user communications now here",
            "Disk message errors encountered during filesystem operations",
            "Debug messages from all running applications on the system"
        ]
    },
    {
        "q": "Why is dmesg useful for privilege escalation?",
        "o": [
            "May reveal kernel version and driver vulnerabilities available",
            "Contains root passwords typed during system boot sequence here",
            "Shows all privilege escalation attempts by other users now",
            "Lists exploits that have been used successfully on the system"
        ]
    },
    {
        "q": "What is the purpose of checking for development tools?",
        "o": [
            "Compilers like gcc help compile kernel exploits on target system",
            "Development tools always include privilege escalation scripts",
            "Dev tools contain default credentials for developer accounts",
            "Development utilities have built-in backdoors for debugging"
        ]
    },
    {
        "q": "What does the which command do?",
        "o": [
            "Shows the path of executable that would run for given command",
            "Identifies which user owns a particular file on the system",
            "Determines which process is using a specific file handle now",
            "Checks which network interface handles traffic for address"
        ]
    },
    {
        "q": "What does the whereis command provide?",
        "o": [
            "Locates binary source and manual page files for a command now",
            "Identifies where a user is logged in from on the network here",
            "Shows where data is being written on the disk currently active",
            "Determines where network traffic is routed for destination"
        ]
    },
    {
        "q": "What is the purpose of /proc filesystem?",
        "o": [
            "Virtual filesystem providing process and kernel information now",
            "Stored procedures for database operations in the operating system",
            "Process control directory for managing running applications here",
            "Professional configuration files for enterprise software tools"
        ]
    },
    {
        "q": "What interesting information is in /proc/version?",
        "o": [
            "Contains kernel version and compiler information for the system",
            "Stores version history of all installed packages on the system",
            "Contains version of root password currently set on the system",
            "Shows versioning information for all configuration files now"
        ]
    },
    {
        "q": "What does /proc/[pid]/cmdline contain?",
        "o": [
            "The command line arguments used to start the process running",
            "Command line interface settings for the process configuration",
            "Commands that can be sent to the process for control purposes",
            "Line count of all commands executed by the process so far"
        ]
    },
    {
        "q": "What is interesting about /proc/[pid]/environ?",
        "o": [
            "Contains environment variables for process which may have secrets",
            "Environment description of the process execution context here",
            "Environmental impact score of the process resource usage now",
            "List of environments where the process can be deployed safely"
        ]
    },
    {
        "q": "What is the purpose of AppArmor on Linux?",
        "o": [
            "Mandatory access control that restricts program capabilities now",
            "Application performance monitoring system for Linux servers here",
            "Armor protection against physical attacks on server hardware",
            "Application installation and removal manager for Linux desktop"
        ]
    },
    {
        "q": "What is SELinux used for?",
        "o": [
            "Mandatory access control providing enhanced security policies now",
            "Linux security through encrypted storage of all user files here",
            "Secure editing of Linux configuration files with audit trail",
            "System enhancement through Linux kernel performance tuning"
        ]
    },
    {
        "q": "How can AppArmor or SELinux affect exploitation?",
        "o": [
            "May restrict actions that exploits can perform even as root now",
            "Always blocks all privilege escalation attempts automatically",
            "Encrypts exploit payloads preventing them from executing here",
            "Alerts administrators immediately when exploitation is attempted"
        ]
    },
    {
        "q": "What command checks if AppArmor is enabled?",
        "o": [
            "The aa-status command shows AppArmor status and profiles loaded",
            "The apparmor-check command displays AppArmor configuration now",
            "The armor-list command shows all AppArmor settings and policies",
            "The lsarmor command lists AppArmor restrictions on the system"
        ]
    },
    {
        "q": "What command checks SELinux status?",
        "o": [
            "The sestatus or getenforce command shows SELinux status now",
            "The secheck command displays SELinux configuration settings here",
            "The linuxse command shows the SELinux policy currently active",
            "The lsselinux command lists SELinux restrictions on the system"
        ]
    },
    {
        "q": "What is a shell escape in context of SUID binaries?",
        "o": [
            "Using SUID binary functionality to spawn shell as file owner",
            "Escaping from restricted shell to gain full command access now",
            "Bypassing shell login prompt to access system without password",
            "Closing shell session to escape from logged terminal activity"
        ]
    },
    {
        "q": "What is the less command shell escape?",
        "o": [
            "Typing !bash in less spawns shell inheriting file permissions",
            "Less command has built-in escape key to exit immediately now",
            "Pressing ESC in less enables shell command mode for user here",
            "Less escapes shell characters preventing command injection now"
        ]
    },
    {
        "q": "What is vim shell escape method?",
        "o": [
            "Using :!bash or :shell in vim spawns shell with vim privileges",
            "Pressing ESC vim exits to shell without saving current file",
            "Vim shell mode allows shell commands but drops after execution",
            "Shell escape in vim logs all commands for security audit now"
        ]
    },
    {
        "q": "Why is the find command useful for escalation?",
        "o": [
            "The find command with -exec can execute commands as owners now",
            "The find command always runs with root privileges on the system",
            "Find locates all exploitable files automatically on filesystem",
            "Find command bypasses all file permission checks during search"
        ]
    },
    {
        "q": "What is Python code execution for privilege escalation?",
        "o": [
            "Running Python as SUID can spawn shell using os.system function",
            "Python automatically escalates privileges for import statements",
            "Python code execution always requires root privileges on Linux",
            "Python disables security features when running SUID binaries"
        ]
    },
    {
        "q": "What is the purpose of checking cron.d directory?",
        "o": [
            "Contains additional cron job configurations that may be writable",
            "Stores credentials for daemon processes running on the system",
            "Contains debug information for cron service troubleshooting now",
            "Holds default configuration templates for new cron job creation"
        ]
    },
    {
        "q": "What directories contain system-wide cron jobs?",
        "o": [
            "Directories like /etc/cron.daily /etc/cron.hourly and similar ones",
            "The /var/cron/system directory contains all system cron jobs now",
            "The /root/cron directory stores privileged system cron tasks here",
            "The /home/cron.sys contains system level scheduled task files"
        ]
    },
    {
        "q": "What is sudo with NOPASSWD vulnerability?",
        "o": [
            "Commands can run as root without requiring password entry here",
            "Sudo disables password for all users when NOPASSWD is set globally",
            "NOPASSWD allows any user to execute any command without limit",
            "Password is stored in plaintext for NOPASSWD configured commands"
        ]
    },
    {
        "q": "How can nmap with SUID be exploited?",
        "o": [
            "Using interactive mode or script to spawn privileged shell now",
            "Nmap automatically gives root when scanning localhost network",
            "Port scans can trigger kernel exploits when run as root user",
            "Network mapping reveals all root passwords on local network"
        ]
    },
    {
        "q": "What is polkit exploit technique?",
        "o": [
            "Exploiting PolicyKit service for root privilege escalation now",
            "Using polkit configuration files to read system passwords here",
            "Polkit always allows privilege escalation for any authenticated user",
            "Policy kit exploits require physical console access to the system"
        ]
    },
    {
        "q": "What is CVE-2021-3156 Baron Samedit?",
        "o": [
            "Heap overflow in sudo allowing root escalation without password",
            "Buffer overflow in SSH daemon allowing remote code execution now",
            "Privilege escalation through misconfigured SUID binary on system",
            "Kernel vulnerability allowing escape from container to host here"
        ]
    },
    {
        "q": "What is CVE-2021-4034 Pwnkit vulnerability?",
        "o": [
            "Memory corruption in pkexec allowing local privilege escalation",
            "Remote code execution in polkit network service without auth now",
            "Privilege escalation through pwned kit configuration files here",
            "Kernel exploit in packet filtering allowing root access to system"
        ]
    },
    {
        "q": "What is the purpose of checking for sudo version?",
        "o": [
            "Certain sudo versions have known exploitable vulnerabilities now",
            "Sudo version determines which commands can be run as root here",
            "Version information reveals password hashing algorithm used now",
            "Newer sudo versions allow exploitation while older are safer"
        ]
    },
    {
        "q": "What is LD_LIBRARY_PATH escalation?",
        "o": [
            "Setting library path to load malicious libraries in SUID programs",
            "Path variable that determines default library for all programs now",
            "Library path that stores encrypted passwords for applications here",
            "Environment variable for loading network libraries automatically"
        ]
    },
    {
        "q": "Why do SUID programs often ignore LD_PRELOAD?",
        "o": [
            "Security feature to prevent library preload attacks on SUID now",
            "SUID programs run before library loader initializes on system here",
            "Preload is only supported for non-SUID applications by design now",
            "Library preloading consumes too much memory for SUID binaries"
        ]
    },
    {
        "q": "What is the awk shell escape command?",
        "o": [
            "Using awk system function to execute shell commands as owner now",
            "Awk built-in escape sequence that exits to parent shell directly",
            "Keyboard shortcut in awk that spawns new shell on the terminal",
            "Awk option that allows escaping special characters in patterns"
        ]
    },
    {
        "q": "How can perl be used for privilege escalation?",
        "o": [
            "Perl with SUID can exec shell using system or backtick operators",
            "Perl scripts automatically run with elevated privileges on Linux",
            "Perl interpreter has backdoor for development debugging purposes",
            "Perl exploits kernel through direct memory access functions now"
        ]
    },
    {
        "q": "What is ruby shell execution for escalation?",
        "o": [
            "Ruby with SUID uses exec or system to spawn privileged shell now",
            "Ruby interpreter has built-in root access for gem installation",
            "Ruby scripts bypass permission checks when running from console",
            "Ruby kernels allow direct system call injection without checks"
        ]
    },
    {
        "q": "How can PHP be exploited for privilege escalation?",
        "o": [
            "PHP with SUID can use system or passthru to execute commands now",
            "PHP interpreter automatically escalates for database operations",
            "PHP scripts have root access when running from command line here",
            "PHP exploits web server configuration to gain elevated privileges"
        ]
    },
    {
        "q": "What is the git shell escape technique?",
        "o": [
            "Git with SUID can spawn shell via pager or editor configuration",
            "Git repositories contain hidden root credentials for deployment",
            "Git automatically runs hooks with elevated privileges on clone now",
            "Git protocol allows remote code execution on local system here"
        ]
    },
    {
        "q": "How can tar be exploited with SUID?",
        "o": [
            "Using tar with checkpoint action to execute arbitrary commands now",
            "Tar automatically extracts files with root ownership on system",
            "Archive files can contain SUID binaries that run after extraction",
            "Tar exploits compression algorithms to execute embedded code here"
        ]
    },
    {
        "q": "What is the zip shell technique?",
        "o": [
            "Using zip with -T option to run test command for code execution",
            "Zip archives contain executable payloads that run on extraction",
            "Zip compression allows embedding shell code in file headers now",
            "Zip with SUID extracts all files with root permissions by default"
        ]
    },
    {
        "q": "How can curl be used for escalation?",
        "o": [
            "Curl with SUID can overwrite files or exfiltrate sensitive data now",
            "Curl automatically passes authentication tokens in all requests",
            "Network requests from curl run with elevated network privileges",
            "Curl exploits SSL certificates to gain access to encrypted files"
        ]
    },
    {
        "q": "What is wget file write escalation?",
        "o": [
            "Wget with SUID can overwrite system files to gain root access now",
            "Wget automatically saves files with root ownership on the system",
            "File downloads via wget bypass permission checks on destination",
            "Wget protocol handlers allow code execution on download completion"
        ]
    },
    {
        "q": "How can systemctl be exploited?",
        "o": [
            "Systemctl with sudo can spawn shell via pager in status output",
            "Service control automatically grants root for any service action",
            "Systemctl configuration files contain service account passwords",
            "System control exploits dbus for privilege escalation on Linux"
        ]
    },
    {
        "q": "What is journalctl shell escape?",
        "o": [
            "Journalctl pager can spawn shell when running with sudo access now",
            "Journal logs contain root password entries for authentication here",
            "Log control automatically runs with elevated privileges for reading",
            "Journalctl exploits systemd to gain access to protected services"
        ]
    },
    {
        "q": "How can mysql be used for privilege escalation?",
        "o": [
            "MySQL running as root can write files to system via SELECT INTO",
            "Database root user automatically has Linux root privileges too",
            "MySQL exploits SQL injection to gain shell access on the server",
            "Database service always stores operating system passwords here"
        ]
    },
    {
        "q": "What is the purpose of lib_mysqludf_sys?",
        "o": [
            "UDF library for executing system commands from MySQL database now",
            "MySQL library for system performance monitoring and optimization",
            "User defined functions for secure database file operations here",
            "System library that encrypts MySQL database connections on Linux"
        ]
    },
    {
        "q": "How can PostgreSQL be exploited for escalation?",
        "o": [
            "Using COPY or extension to read write files or execute commands",
            "PostgreSQL automatically grants OS access to database admins now",
            "Database exploits allow reading /etc/shadow through SQL queries",
            "Postgres user always maps to root on the Linux operating system"
        ]
    },
    {
        "q": "What is Redis unauthorized access escalation?",
        "o": [
            "Writing SSH keys or cron jobs via Redis config command function",
            "Redis stores root password in plaintext memory for fast access",
            "Database cache automatically grants shell to connected clients",
            "Redis exploits memory corruption for kernel level code execution"
        ]
    },
    {
        "q": "How can Apache web server be exploited?",
        "o": [
            "Writable webroot or config files can lead to code execution now",
            "Apache always runs as root by default on Linux distributions here",
            "Web server exploits allow reading kernel memory through requests",
            "Apache configuration reveals all system user passwords in logs"
        ]
    },
    {
        "q": "What is PHP web shell for privilege escalation?",
        "o": [
            "Uploading PHP file that executes system commands as web user now",
            "PHP shells automatically run with root privileges on web server",
            "Web shell is built-in PHP feature for remote administration here",
            "PHP execution creates reverse connection to attacker with root"
        ]
    },
    {
        "q": "What is the purpose of checking for Docker socket?",
        "o": [
            "Docker socket access allows spawning privileged containers for root",
            "Docker socket contains authentication tokens for container registry",
            "Socket files store Docker daemon passwords for remote management",
            "Docker communication reveals network configuration of all containers"
        ]
    },
    {
        "q": "How does mounting host filesystem in Docker help?",
        "o": [
            "Mounting host root allows reading and writing system files as root",
            "Container filesystems automatically sync with host periodically",
            "Mount operation reveals sensitive configuration from host system",
            "Filesystem mounting bypasses Docker network isolation features now"
        ]
    },
    {
        "q": "What is the /etc/shadow format?",
        "o": [
            "Username and hashed password separated by colons in each line now",
            "Encrypted file containing binary password data for all users here",
            "Shadow file stores passwords in plaintext for system authentication",
            "Format includes username password and permission bits for user"
        ]
    },
    {
        "q": "What is the significance of $6$ prefix in password hash?",
        "o": [
            "Indicates SHA-512 hashing algorithm used for the password hash now",
            "Represents level six encryption strength for the password storage",
            "Shows password was set using version 6 of Linux authentication",
            "Indicates the hash requires 6 rounds for verification on system"
        ]
    },
    {
        "q": "What tool combines passwd and shadow for cracking?",
        "o": [
            "The unshadow utility combines files for password cracking tools now",
            "The passjoin command merges authentication files for analysis here",
            "The hashcat utility automatically reads both files simultaneously",
            "The shadowcat tool concatenates files for john the ripper usage"
        ]
    },
    {
        "q": "What is hashcat used for in escalation?",
        "o": [
            "GPU accelerated password hash cracking for offline attacks on hashes",
            "Hash table lookup for instant password recovery from database now",
            "Generating password hashes for adding users to shadow file here",
            "Cataloging all hash types found during system enumeration phase"
        ]
    },
    {
        "q": "What is the difference between online and offline password attacks?",
        "o": [
            "Offline attacks work on captured hashes without network limits now",
            "Online attacks are faster because they use multiple servers here",
            "Offline requires internet while online works without connection",
            "Online attacks target hashes while offline targets live services"
        ]
    },
    {
        "q": "What is privilege escalation via cron PATH?",
        "o": [
            "Cron job uses PATH that includes writable directory for hijacking",
            "PATH variable in cron reveals scheduled commands for exploitation",
            "Cron automatically adds all directories to PATH for convenience",
            "PATH setting determines which user the cron job runs as now here"
        ]
    },
    {
        "q": "What is an anacron job?",
        "o": [
            "Scheduled task that runs after startup if missed during downtime",
            "Cron jobs specific to Anaconda Python distribution on the system",
            "Advanced cron with network awareness for distributed task running",
            "Anacron is security hardened version of cron with audit logging"
        ]
    },
    {
        "q": "What is the pspy tool used for?",
        "o": [
            "Monitors processes and cron jobs without requiring root privileges",
            "Python spy tool for capturing network traffic between processes",
            "Process listing tool that reveals hidden processes on the system",
            "Spy utility for reading memory contents of running applications"
        ]
    },
    {
        "q": "How can writable /etc/cron.d lead to escalation?",
        "o": [
            "Adding custom cron file that executes commands as root user now",
            "Cron.d directory allows reading other users scheduled task files",
            "Directory contains debug logs with command execution history here",
            "Cron.d stores encrypted passwords for scheduled task execution"
        ]
    },
    {
        "q": "What is the significance of CAP_DAC_OVERRIDE?",
        "o": [
            "Bypasses file permission checks for reading writing any file now",
            "Override capability for digital audio converter on the system here",
            "Discretionary access control disabling for container processes now",
            "Database access control override for privileged query execution"
        ]
    },
    {
        "q": "What is CAP_DAC_READ_SEARCH capability?",
        "o": [
            "Allows reading any file and traversing any directory on system now",
            "Capability for database search operations without authentication",
            "Read search capability for locating files across all filesystems",
            "Digital access control read search for encrypted file operations"
        ]
    },
    {
        "q": "What does CAP_NET_RAW capability enable?",
        "o": [
            "Allows raw network packet access for sniffing and spoofing now",
            "Network raw data transmission without encryption requirement here",
            "Raw capture of network administrator credentials on local network",
            "Capability for creating raw network partitions for isolation now"
        ]
    },
    {
        "q": "What is CAP_CHOWN capability?",
        "o": [
            "Allows changing file ownership to arbitrary user or group now here",
            "Change ownership of network connections between processes on host",
            "Capability for creating files with any ownership during execution",
            "Chown change capability for modifying credential store ownership"
        ]
    },
    {
        "q": "What is shared object injection attack?",
        "o": [
            "Injecting malicious shared library into process library loading now",
            "Sharing objects between processes for inter-process communication",
            "Injection of data objects into shared memory segments on system",
            "Object oriented injection attack against database applications"
        ]
    },
    {
        "q": "What is the purpose of checking LD_DEBUG?",
        "o": [
            "Debug library loading to identify libraries searched by programs now",
            "Load debug symbols for analyzing program execution vulnerabilities",
            "Library debugging reveals encryption keys stored in shared objects",
            "Debug mode exposes root password during library initialization here"
        ]
    },
    {
        "q": "What is the NFS anonuid option?",
        "o": [
            "Sets UID for anonymous access to NFS share for privilege mapping now",
            "Anonymous user ID assigned to NFS traffic for network encryption",
            "Unique identifier for anonymous NFS audit logs on the server here",
            "UID option that disables anonymous access to exported NFS shares"
        ]
    },
    {
        "q": "What is the showmount command used for?",
        "o": [
            "Displays NFS exports available from remote NFS server for mounting",
            "Shows mounted filesystems on local system including NFS mounts here",
            "Mounts NFS share and displays content of remote filesystem on host",
            "Shows mount count statistics for all filesystems on the system now"
        ]
    },
    {
        "q": "What is rpcinfo command used for?",
        "o": [
            "Lists RPC services running on remote host including NFS services now",
            "Displays remote procedure call information for database services",
            "Shows information about removed processes cleaned by garbage collector",
            "RPC info command for configuring remote printer connections here"
        ]
    },
    {
        "q": "What is kernel version 2.6.22 notable for?",
        "o": [
            "Vulnerable to vmsplice local privilege escalation exploit attack now",
            "First kernel version with mandatory access control support here",
            "Introduced security features that prevent most common exploits now",
            "Removed root user making privilege escalation impossible on Linux"
        ]
    },
    {
        "q": "What is DirtyCOW CVE number?",
        "o": [
            "CVE-2016-5195 is the DirtyCOW race condition vulnerability now here",
            "CVE-2017-7533 is assigned to DirtyCOW kernel exploit on Linux now",
            "CVE-2018-1000001 identifies DirtyCOW memory corruption bug on system",
            "CVE-2019-5591 is the DirtyCOW privilege escalation CVE number now"
        ]
    },
    {
        "q": "What is Dirty Pipe vulnerability?",
        "o": [
            "CVE-2022-0847 allows overwriting read only files via pipe splicing",
            "Pipe cleaning vulnerability allowing code injection into processes",
            "Dirty pipe allows reading encrypted pipes between processes on host",
            "Pipeline vulnerability for bypassing SELinux restrictions on files"
        ]
    },
    {
        "q": "What kernels are affected by Dirty Pipe?",
        "o": [
            "Linux kernel 5.8 and later until patched versions are vulnerable now",
            "All Linux kernels from version 2.6 onwards are affected by this bug",
            "Only specifically compiled kernels with debug options are vulnerable",
            "Kernels with pipe support disabled are the only affected versions"
        ]
    },
    {
        "q": "What is the purpose of exploit-db.com?",
        "o": [
            "Database of public exploits and proof of concepts for research now",
            "Official database for reporting exploits to Linux kernel team here",
            "Database that stores encrypted exploits requiring license to view",
            "Developer community for sharing debugging tools and techniques now"
        ]
    },
    {
        "q": "What is searchsploit tool?",
        "o": [
            "Command line tool to search exploit database offline locally now",
            "Web search engine for finding security exploits on internet here",
            "Sploit searcher for automatically testing exploits against target",
            "Search tool that finds hardcoded passwords in application code"
        ]
    },
    {
        "q": "What is the purpose of msfvenom?",
        "o": [
            "Generates payloads and shellcode for exploitation of vulnerabilities",
            "Venom scanner for detecting malware and security vulnerabilities",
            "MSF verification tool for validating exploit code before execution",
            "Vendor management software for security patch deployment on Linux"
        ]
    },
    {
        "q": "What is a reverse shell in exploitation?",
        "o": [
            "Target connects back to attacker machine providing shell access now",
            "Shell that reverses permission checks allowing unprivileged access",
            "Reverse engineering tool for analyzing shell script vulnerabilities",
            "Shell interface that logs commands in reverse chronological order"
        ]
    },
    {
        "q": "What is a bind shell in exploitation?",
        "o": [
            "Target opens port and listens for attacker connection to shell now",
            "Shell bound to specific user preventing privilege escalation here",
            "Bind mount that provides shell access to mounted filesystem path",
            "Shell script that binds keyboard input to system commands on host"
        ]
    },
    {
        "q": "What is the advantage of reverse shell over bind shell?",
        "o": [
            "Bypasses firewall rules that block incoming connections to target",
            "Reverse shell provides encrypted communication unlike bind shell",
            "Reverse shells are faster because connection is already established",
            "Bind shells require root while reverse shells work as any user"
        ]
    },
    {
        "q": "What is netcat used for in escalation?",
        "o": [
            "Creating reverse or bind shells for remote command execution now",
            "Network category tool for organizing exploits by target type here",
            "Concatenating network traffic logs for security analysis purposes",
            "Network catalog of available exploits for current kernel version"
        ]
    },
    {
        "q": "What is socat advantage over netcat?",
        "o": [
            "Socat supports encryption and more complex connection options now",
            "Socket cat has better performance for large payload transfers here",
            "Socat automatically escalates privileges during connection setup",
            "Socket concatenation provides persistent backdoor unlike netcat"
        ]
    },
    {
        "q": "What is the Python PTY reverse shell?",
        "o": [
            "Using python pty module to get fully interactive reverse shell now",
            "Python pretty shell formatting for better command output display",
            "PTY shell that bypasses Python security sandbox restrictions here",
            "Proprietary terminal for Python script execution with root access"
        ]
    },
    {
        "q": "What is shell stabilization technique?",
        "o": [
            "Upgrading simple shell to fully interactive TTY with job control now",
            "Making shell persistent across reboots through service installation",
            "Stabilizing shell connection to prevent network timeout disconnection",
            "Shell backup technique for recovering access after exploitation here"
        ]
    },
    {
        "q": "What command upgrades shell to interactive TTY?",
        "o": [
            "Using python -c import pty; pty.spawn /bin/bash for TTY shell now",
            "Running upgrade-shell command to convert to interactive terminal",
            "Executing tty-enable to activate interactive mode on current shell",
            "Using shell-enhance utility to add interactive features to session"
        ]
    },
    {
        "q": "What does stty raw -echo do?",
        "o": [
            "Configures terminal for proper interactive shell behavior on attack",
            "Stores TTY configuration in raw format without echoing passwords",
            "Standard TTY raw mode disables shell for security purposes now here",
            "Enables raw disk access through TTY interface on Linux system now"
        ]
    },
    {
        "q": "What is a web shell persistence technique?",
        "o": [
            "Placing accessible PHP or script file in webroot for shell access",
            "Web browser extension that maintains shell access to web server",
            "Shell that persists in web browser memory across page reloads now",
            "Persistent web session that maintains root privileges on server"
        ]
    },
    {
        "q": "What is cron job persistence?",
        "o": [
            "Adding scheduled task that runs malicious script for persistent access",
            "Cron configuration that persists across system updates and patches",
            "Persistent cron logging for tracking job execution history on host",
            "Job scheduling that survives user logout but not system reboot now"
        ]
    },
    {
        "q": "What is SSH key persistence?",
        "o": [
            "Adding attacker public key to authorized_keys for persistent login",
            "SSH configuration that keeps connections alive during idle periods",
            "Key persistence technique for reusing SSH sessions without reauth",
            "Storing SSH private keys in persistent storage for later retrieval"
        ]
    },
    {
        "q": "What is bashrc persistence technique?",
        "o": [
            "Adding malicious commands to bashrc that execute on user login now",
            "Bash configuration that persists environment variables across boots",
            "Bashrc modification for maintaining colorized prompt on terminal",
            "Persistent bash history that survives shell session termination"
        ]
    },
    {
        "q": "What is systemd service persistence?",
        "o": [
            "Creating service unit file that runs malicious code at boot time now",
            "Systemd configuration for persisting service logs across restarts",
            "Service definition that survives systemd daemon restart on host",
            "Persistent service that maintains network connections when idle"
        ]
    },
    {
        "q": "What is init.d script persistence?",
        "o": [
            "Adding startup script to init.d for execution during system boot now",
            "Init daemon configuration for persisting service state across runs",
            "Initialization script that maintains daemon in memory persistently",
            "Persistent init configuration for rapid service restart on failure"
        ]
    },
    {
        "q": "What is the purpose of checking for installed compilers?",
        "o": [
            "Compilers allow compiling kernel exploits directly on target system",
            "Installed compilers always contain debugging backdoors for testing",
            "Compiler presence indicates development environment with weak security",
            "Compilers reveal kernel version through included header files now"
        ]
    },
    {
        "q": "What is cross-compilation for exploits?",
        "o": [
            "Compiling exploit on different architecture for target system now here",
            "Compilation technique that crosses security boundaries during build",
            "Cross-referencing multiple exploits for improved success rate now",
            "Compiler option for creating architecture independent exploit code"
        ]
    },
    {
        "q": "What is static linking for exploit portability?",
        "o": [
            "Including all library code in binary eliminating library dependencies",
            "Linking exploit to static network address for reliable connectivity",
            "Static analysis linking for detecting vulnerability before runtime",
            "Portability technique using static HTML for cross-platform exploits"
        ]
    },
    {
        "q": "What is the purpose of checking kernel modules?",
        "o": [
            "Loaded modules may have known vulnerabilities exploitable for root",
            "Kernel modules always contain debug passwords for development use",
            "Module list reveals hardware backdoors installed on the system now",
            "Checking modules ensures antivirus is not blocking exploit execution"
        ]
    },
    {
        "q": "What command lists loaded kernel modules?",
        "o": [
            "The lsmod command lists all currently loaded kernel modules on system",
            "The modlist command displays kernel modules with detailed information",
            "The kernmod command shows all installed and loaded modules on Linux",
            "The listmod command reveals kernel module dependencies and status"
        ]
    },
    {
        "q": "What is modinfo command used for?",
        "o": [
            "Displays detailed information about specific kernel module on system",
            "Modifies module information for configuration purposes on Linux now",
            "Information tool for validating module signatures before loading",
            "Module information extractor for reverse engineering kernel drivers"
        ]
    },
    {
        "q": "What is the significance of readable /root directory?",
        "o": [
            "May contain SSH keys history files or sensitive root configuration now",
            "Root directory always contains backup of all user passwords on system",
            "Readable root indicates misconfigured system without root account now",
            "Root directory stores kernel exploits for emergency system recovery"
        ]
    },
    {
        "q": "What interesting file is .mysql_history?",
        "o": [
            "Contains previous MySQL commands that may include passwords typed now",
            "MySQL history configuration file with database connection settings",
            "Historical MySQL performance data for database optimization purposes",
            "History of MySQL patch updates applied to database server on host"
        ]
    },
    {
        "q": "What is .pgpass file?",
        "o": [
            "PostgreSQL password file containing database credentials in plaintext",
            "PGP encryption pass file for encrypted communication on the system",
            "Page pass configuration for web application pagination settings now",
            "Program pass file storing executable password for SUID binaries"
        ]
    },
    {
        "q": "What is the .my.cnf file?",
        "o": [
            "MySQL configuration file that may contain database password values now",
            "My custom network file for network interface configuration on host",
            "Configuration file for managing cloud infrastructure on Linux here",
            "My configuration notes file typically empty on most Linux systems"
        ]
    },
    {
        "q": "What is the purpose of environment variable MAIL?",
        "o": [
            "Points to user mail spool which might contain sensitive information",
            "Mail variable enables email functionality for shell commands on host",
            "Environment setting that mails command output to administrator now",
            "Mail configuration for receiving security alerts from the kernel"
        ]
    },
    {
        "q": "What is the /var/mail directory?",
        "o": [
            "Contains user mail spools that may have application passwords or info",
            "Mail server directory with encrypted email storage for all users now",
            "Variable mail configuration for dynamic email routing on the system",
            "Mailing list subscriptions stored by the system for all users here"
        ]
    },
    {
        "q": "What is the significance of checking logs?",
        "o": [
            "Logs may contain passwords or commands with sensitive arguments now",
            "Logs always contain detailed exploit instructions for attackers here",
            "Log files indicate which security patches need to be exploited now",
            "Checking logs helps hide traces of exploitation from administrators"
        ]
    },
    {
        "q": "What log files are commonly checked?",
        "o": [
            "Files like auth.log syslog and application logs for sensitive data now",
            "Only /var/log/security contains exploitable information on Linux here",
            "Log files in /root/logs contain root activity useful for escalation",
            "Debug logs in /tmp contain kernel vulnerability information now"
        ]
    },
    {
        "q": "What is password spraying vs brute force?",
        "o": [
            "Spraying tries few passwords across many accounts avoiding lockout now",
            "Brute force is slower but more stealthy than password spraying here",
            "Spraying uses dictionary while brute force uses generated passwords",
            "Brute force targets one account while spraying targets the network"
        ]
    },
    {
        "q": "What is the hydra tool used for?",
        "o": [
            "Online password brute forcing against various network services now",
            "Hydra is filesystem recovery tool for corrupted disk partitions here",
            "Network hydration tool for maintaining persistent connections on host",
            "Hybrid analysis tool combining static and dynamic vulnerability scan"
        ]
    },
    {
        "q": "What is the medusa brute force tool?",
        "o": [
            "Parallel password brute forcer for rapid authentication attacks now",
            "Medusa version management tool for system package coordination here",
            "Malware detection using signature analysis and behavioral monitoring",
            "Memory dumping utility for extracting credentials from processes"
        ]
    },
    {
        "q": "What is the purpose of checking /etc/fstab?",
        "o": [
            "May reveal mount options credentials or misconfigured mount points now",
            "Fstab contains fast boot configuration speeding exploitation setup",
            "File system table always contains backup root password for recovery",
            "Fstab defines firewall rules for mounted network filesystems here"
        ]
    },
    {
        "q": "What is automount exploitation?",
        "o": [
            "Exploiting automount configuration to mount attacker controlled share",
            "Automatic mounting of filesystems always uses root credentials now",
            "Automount attack injects code into mount point creation process here",
            "Mount automation vulnerability revealing encryption keys on access"
        ]
    },
    {
        "q": "What is the purpose of checking for interesting groups?",
        "o": [
            "Certain group memberships grant access to sensitive resources or files",
            "Groups always contain password hashes for all member accounts on host",
            "Interesting groups indicate administrative users who can be targeted",
            "Group enumeration reveals network topology for lateral movement now"
        ]
    },
    {
        "q": "What access does adm group provide?",
        "o": [
            "Read access to log files in /var/log directory on most distributions",
            "Administrative access equivalent to root on the Linux system now here",
            "Administer database management allowing access to all databases now",
            "Advanced disk management for partition creation and formatting tasks"
        ]
    },
    {
        "q": "What access does the disk group provide?",
        "o": [
            "Raw access to disks bypassing filesystem permission checks on system",
            "Disk quota management for setting user storage limits across volumes",
            "Disk encryption key access for decrypting protected filesystems now",
            "Disk monitoring allowing reading SMART data from storage devices"
        ]
    },
    {
        "q": "What does video group membership allow?",
        "o": [
            "Access to framebuffer devices potentially capturing screen content now",
            "Video encoding and decoding without hardware acceleration support",
            "Video driver installation requiring elevated privileges on system",
            "Video streaming of desktop session to remote monitoring station"
        ]
    },
    {
        "q": "What is the staff group used for?",
        "o": [
            "Writing to certain system directories like /usr/local without root now",
            "Staff member access to administrative functions on the server here",
            "System administration staff communicating via privileged channels",
            "Staff authentication group for granting login to secure terminals"
        ]
    },
    {
        "q": "What is shadow group used for?",
        "o": [
            "Reading /etc/shadow and /etc/gshadow password hash files on system",
            "Creating shadow copies of files for backup and recovery purposes now",
            "Shadow process execution running hidden from normal process listing",
            "Shadowing user sessions for security monitoring activities on host"
        ]
    },
    {
        "q": "What is Kubernetes privilege escalation?",
        "o": [
            "Exploiting misconfigured pods or RBAC to escape to host or gain access",
            "Kubernetes automatically grants root to all container processes now",
            "K8s privilege escalation requires physical access to cluster nodes",
            "Container orchestration prevents all privilege escalation by design"
        ]
    },
    {
        "q": "What is hostPID namespace vulnerability?",
        "o": [
            "Container can see host processes enabling PID namespace attacks now",
            "Host PID setting allows container to create unlimited processes here",
            "PID namespace sharing improves performance but has no security impact",
            "Host PID grants administrative access to Kubernetes control plane"
        ]
    },
    {
        "q": "What is hostNetwork namespace vulnerability?",
        "o": [
            "Container shares host network allowing access to local services here",
            "Network namespace enables container to communicate externally only",
            "Host network provides encrypted communication channel for container",
            "Network sharing allows container to view all cluster traffic now"
        ]
    },
    {
        "q": "What is privileged container vulnerability?",
        "o": [
            "Container runs with almost all host capabilities enabling escapes now",
            "Privileged containers have enhanced logging for security auditing",
            "Privilege mode restricts container access to sensitive host resources",
            "Containerized applications automatically get privilege restrictions"
        ]
    },
    {
        "q": "What is containerd-shim CVE-2020-15257?",
        "o": [
            "Abstract unix socket exposure allowing container escape to host now",
            "Shim memory corruption allowing arbitrary code execution in kernel",
            "Container daemon privilege escalation through malformed API requests",
            "Shim configuration vulnerability exposing host filesystem to pods"
        ]
    },
    {
        "q": "What is runc CVE-2019-5736?",
        "o": [
            "Container escape by overwriting host runc binary through proc mount",
            "Runtime memory corruption allowing kernel code execution from pod",
            "Container network bypass allowing direct host communication now",
            "Run context vulnerability exposing secrets to unprivileged containers"
        ]
    },
    {
        "q": "What is Docker socket mount exploitation?",
        "o": [
            "Mounting docker.sock in container allows creating privileged containers",
            "Socket mounting enables encrypted communication with Docker daemon",
            "Docker socket provides read only access to container configuration",
            "Mount exploitation requires pre-existing root access in container"
        ]
    },
    {
        "q": "What is Linux namespace escape technique?",
        "o": [
            "Breaking out of isolated namespace to access resources in parent now",
            "Creating new namespaces to hide malicious processes from detection",
            "Namespace merging for combining privileges from multiple containers",
            "Escape technique for bypassing namespace resource accounting limits"
        ]
    },
    {
        "q": "What is cgroup escape vulnerability?",
        "o": [
            "Exploiting release_agent or other cgroup features to run host code now",
            "Cgroup memory limit bypass for allocating unlimited memory in pod",
            "Control group escape allows viewing all processes on the host system",
            "Cgroup vulnerability exposing container resource usage statistics"
        ]
    },
    {
        "q": "What is the release_agent escape technique?",
        "o": [
            "Writing script path to release_agent which executes on cgroup exit now",
            "Releasing agent process that monitors container resource utilization",
            "Agent escape technique bypassing containerization through signaling",
            "Release mechanism for agent containers to access protected resources"
        ]
    },
    {
        "q": "What is /proc/sys/kernel/core_pattern exploitation?",
        "o": [
            "Setting core pattern to execute program when process crashes on host",
            "Core pattern file reveals kernel memory layout for exploitation now",
            "Pattern matching file for identifying core dump files on filesystem",
            "Kernel core configuration determining which modules are loaded now"
        ]
    },
    {
        "q": "What is eBPF privilege escalation?",
        "o": [
            "Exploiting eBPF verifier bugs to execute arbitrary kernel code now",
            "Extended BPF always requires root making it safe from exploitation",
            "BPF programs can read kernel memory without any privilege checks",
            "eBPF provides unprivileged users access to network tracing data"
        ]
    },
    {
        "q": "What is io_uring vulnerability?",
        "o": [
            "Kernel subsystem with multiple vulnerabilities enabling root access now",
            "IO ring buffer overflow causing denial of service on the system here",
            "User ring interface vulnerability exposing file descriptor table now",
            "IO subsystem bug allowing unprivileged access to direct IO operations"
        ]
    },
    {
        "q": "What is nf_tables vulnerability?",
        "o": [
            "Netfilter subsystem bugs leading to kernel privilege escalation now",
            "Network filtering vulnerability exposing firewall rules to users",
            "NF tables provide unprivileged packet dropping on network interfaces",
            "Filtering table corruption causing network denial of service only"
        ]
    },
    {
        "q": "What is overlayfs privilege escalation?",
        "o": [
            "Overlay filesystem bugs allowing SUID file creation in container now",
            "Filesystem overlay providing read only access to host directories here",
            "Overlay feature enabling container filesystem isolation by default now",
            "FS privilege escalation requiring misconfigured overlay mount points"
        ]
    },
    {
        "q": "What is user namespace privilege escalation?",
        "o": [
            "Creating user namespace to gain capabilities then exploit kernel bugs",
            "User namespaces provide complete isolation preventing all exploits now",
            "Namespace privileges only apply within namespace having no host impact",
            "User namespace requires CAP_SYS_ADMIN preventing unprivileged access"
        ]
    },
    {
        "q": "What is CAP_SYS_ADMIN capability?",
        "o": [
            "Extremely powerful capability granting many root-like privileges now",
            "System administration capability required for user management only",
            "Admin capability for reading system configuration files on host here",
            "SYS_ADMIN grants access to admin-level logging and monitoring tools"
        ]
    },
    {
        "q": "What is CAP_SYS_PTRACE capability?",
        "o": [
            "Allows tracing and controlling any process enabling credential theft",
            "Process tracing capability for debugging applications in development",
            "PTRACE capability restricted to tracing child processes only by default",
            "System trace capability for viewing system call logs on the host now"
        ]
    },
    {
        "q": "What is CAP_NET_ADMIN capability?",
        "o": [
            "Network configuration capability enabling interface and routing changes",
            "Administrator access to network monitoring tools on the system now",
            "Network capability providing read only access to routing tables here",
            "Admin capability for viewing network statistics without modification"
        ]
    },
    {
        "q": "What is ret2usr attack technique?",
        "o": [
            "Returnin to user space code from kernel context exploiting SMEP bypass",
            "Return to user technique for redirecting shell access to attacker now",
            "User return attack overwriting shell pointers in user space memory",
            "Ret2usr creates user account with elevated privileges on the system"
        ]
    },
    {
        "q": "What is SMEP protection?",
        "o": [
            "Supervisor Mode Execution Prevention blocking kernel exec in user pages",
            "System memory encryption protection for sensitive kernel data now",
            "Security mode enabling protection against memory disclosure attacks",
            "SMEP provides secure memory partitioning for process isolation here"
        ]
    },
    {
        "q": "What is SMAP protection?",
        "o": [
            "Supervisor Mode Access Prevention blocking kernel access to user data",
            "System memory access protection encrypting kernel memory regions now",
            "Security mode access preventing user processes from reading kernel",
            "SMAP provides stack memory allocation protection against overflow"
        ]
    },
    {
        "q": "What is KASLR bypass technique?",
        "o": [
            "Leaking kernel addresses to defeat address space layout randomization",
            "KASLR bypass automatically enabled when user has CAP_SYS_RAWIO now",
            "Kernel address bypass allows executing user code in kernel mode here",
            "KASLR is disabled on most distributions for performance optimization"
        ]
    },
    {
        "q": "What is KPTI protection?",
        "o": [
            "Kernel page table isolation separating user and kernel page tables now",
            "Kernel protection technology initializer preventing code injection",
            "Page table integrity protection against modification by user processes",
            "KPTI provides kernel process tracing interface for security auditing"
        ]
    },
    {
        "q": "What is Stack Canary protection?",
        "o": [
            "Random value on stack checked before return to detect buffer overflow",
            "Stack canary provides stack size limits preventing excessive allocation",
            "Canary protection encrypts return addresses on the stack for security",
            "Stack protection mechanism that isolates function local variables now"
        ]
    },
    {
        "q": "What is NX bit protection?",
        "o": [
            "No execute bit preventing code execution in data memory regions now",
            "Network execution bit allowing remote code execution on the system",
            "NX protection disables execution of kernel code by user processes",
            "Bit protection for nx files preventing modification or deletion now"
        ]
    },
    {
        "q": "What is ASLR in Linux?",
        "o": [
            "Address Space Layout Randomization randomizing memory addresses now",
            "Advanced security layer randomizing authentication challenges here",
            "Application security library runtime for secure program execution",
            "ASLR automatically resets root password daily for security purposes"
        ]
    },
    {
        "q": "What is heap spray attack?",
        "o": [
            "Allocating many objects to control heap memory layout for exploitation",
            "Spray attack filling heap with junk data to cause denial of service",
            "Heap memory cleanup attack removing sensitive data from memory now",
            "Memory spray technique for identifying heap overflow vulnerabilities"
        ]
    },
    {
        "q": "What is use after free vulnerability?",
        "o": [
            "Accessing memory after it has been freed allowing code execution now",
            "Using freed disk space to store unauthorized data on the filesystem",
            "Free memory vulnerability exposing kernel memory to user processes",
            "User after free occurs when inactive users retain access to system"
        ]
    },
    {
        "q": "What is double free vulnerability?",
        "o": [
            "Freeing same memory twice corrupting allocator metadata for exploits",
            "Double free memory attack allocating twice the normal memory amount",
            "Free operation vulnerability allowing unauthorized file deletion now",
            "Freeing memory doubles the available heap space for applications"
        ]
    },
    {
        "q": "What is kernel heap overflow?",
        "o": [
            "Overflowing kernel heap buffer to corrupt adjacent memory objects now",
            "Heap overflow causing kernel crash and denial of service condition",
            "Kernel memory overflow error triggering automatic system recovery",
            "Heap buffer increases to accommodate large kernel data structures"
        ]
    },
    {
        "q": "What is kernel stack overflow?",
        "o": [
            "Overflowing limited kernel stack to corrupt return addresses or data",
            "Stack overflow causing kernel to allocate additional stack pages now",
            "Kernel stack errors automatically recovered by kernel memory manager",
            "Stack overflow detection triggers automatic process termination now"
        ]
    },
    {
        "q": "What is ROP chain in kernel exploitation?",
        "o": [
            "Chaining return oriented programming gadgets for kernel code execution",
            "ROP protection mechanism preventing return address modification now",
            "Chain of responsible processes for handling kernel security events",
            "Routing operations protocol for kernel network packet processing"
        ]
    },
    {
        "q": "What is JOP attack technique?",
        "o": [
            "Jump oriented programming using indirect jumps instead of returns now",
            "JOP provides job oriented processing for parallel kernel operations",
            "Jump protection bypass for executing arbitrary jumps in kernel mode",
            "Just in time operation processing for optimized kernel code paths"
        ]
    },
    {
        "q": "What is modprobe_path exploitation?",
        "o": [
            "Overwriting modprobe path to execute arbitrary code as root user now",
            "Module probe path configuration for automatic kernel module loading",
            "Modprobe exploitation requires pre-existing root access on system",
            "Path probing technique for locating kernel modules on filesystem"
        ]
    },
    {
        "q": "What is the poweroff_cmd exploitation?",
        "o": [
            "Overwriting poweroff_cmd path to execute code when shutdown triggered",
            "Power command exploitation requires physical access to the system now",
            "Poweroff command path is protected and cannot be modified normally",
            "CMD exploitation technique for injecting commands into shutdown"
        ]
    },
    {
        "q": "What is kernel object corruption?",
        "o": [
            "Corrupting kernel object metadata to achieve arbitrary read write now",
            "Object corruption causing kernel panic and system crash condition",
            "Kernel objects are protected and cannot be corrupted by exploits here",
            "Corruption detection triggers automatic kernel self healing process"
        ]
    },
    {
        "q": "What is msg_msg exploitation?",
        "o": [
            "Abusing System V message structure for kernel heap manipulation now",
            "Message exploitation requiring elevated privileges on the system here",
            "MSG structure provides secure message passing between processes now",
            "Message queue exploitation reveals inter-process communication data"
        ]
    },
    {
        "q": "What is pipe_buffer exploitation?",
        "o": [
            "Corrupting pipe buffer structure for kernel memory read write access",
            "Pipe buffer overflow causing denial of service through memory leak",
            "Buffer exploitation triggered by malformed data in named pipes now",
            "Pipe buffers are isolated preventing cross process exploitation here"
        ]
    },
    {
        "q": "What is sk_buff exploitation?",
        "o": [
            "Abusing socket buffer structure for kernel heap grooming and attacks",
            "Socket key buffer exploitation requiring network packet injection now",
            "SK buffers provide encrypted socket communication preventing attacks",
            "Buffer exploitation allows reading network credentials from kernel"
        ]
    },
    {
        "q": "What is timerfd exploitation?",
        "o": [
            "Using timer file descriptor objects for kernel heap exploitation now",
            "Timer exploitation causing system clock manipulation for DoS attack",
            "FD timer allows scheduling code execution with elevated privileges",
            "Timerfd provides accurate timing without security implications here"
        ]
    },
    {
        "q": "What is userfaultfd exploitation?",
        "o": [
            "Abusing userfaultfd to pause kernel operations for race conditions now",
            "User fault handling providing secure memory management for processes",
            "FD exploitation technique for reading kernel fault handling routines",
            "Userfaultfd requires root preventing unprivileged exploitation here"
        ]
    },
    {
        "q": "What is FUSE exploitation technique?",
        "o": [
            "Using filesystem in userspace to control kernel file operations now",
            "FUSE exploitation requiring elevated privileges on the system here",
            "Filesystem exploitation bypassing all permission checks on files now",
            "FUSE provides isolated filesystem preventing kernel exploitation"
        ]
    },
    {
        "q": "What is dirtyCred vulnerability?",
        "o": [
            "Swapping kernel credential structures to escalate privileges to root",
            "Credential dirtying attack exposing authentication tokens on system",
            "DirtyCred requires specific kernel configuration to be exploitable",
            "Credential vulnerability allowing reading of user password hashes"
        ]
    },
    {
        "q": "What is ASLR entropy reduction attack?",
        "o": [
            "Reducing randomization bits making address prediction feasible now",
            "Entropy attacks cause system random number generator to fail here",
            "ASLR reduction providing enhanced security through simplified layout",
            "Attack entropy measurement for evaluating exploit success probability"
        ]
    },
    {
        "q": "What is seccomp bypass technique?",
        "o": [
            "Finding allowed syscalls that achieve same goal as blocked ones now",
            "Seccomp bypass automatically disabled when running with privileges",
            "Bypass technique requiring kernel modification for seccomp disabling",
            "Seccomp filter bypass through direct kernel memory manipulation here"
        ]
    },
    {
        "q": "What is AppArmor bypass technique?",
        "o": [
            "Finding paths or operations not covered by current AppArmor profile now",
            "AppArmor bypass requiring kernel module unloading for deactivation",
            "Bypass technique using symlinks to access protected resources directly",
            "AppArmor cannot be bypassed requiring complete system compromise"
        ]
    },
    {
        "q": "What is SELinux bypass technique?",
        "o": [
            "Exploiting permissive domains or policy gaps for unauthorized access now",
            "SELinux bypass requiring administrative access for policy modification",
            "Bypass technique disabling SELinux through kernel parameter setting",
            "SELinux provides complete protection against all bypass attempts here"
        ]
    },
    {
        "q": "What is capability bounding set?",
        "o": [
            "Maximum capabilities process can acquire limiting privilege escalation",
            "Bounding set containing all capabilities currently active on system now",
            "Capability set defining which users can escalate their privileges here",
            "Set of capabilities that are bound to specific executable binaries"
        ]
    },
    {
        "q": "What is ambient capability set?",
        "o": [
            "Capabilities preserved across non root setuid exec for limited privesc",
            "Ambient capabilities automatically granted to all new processes now",
            "Capability set defining background process privilege limitations here",
            "Set of ambient system capabilities active during maintenance mode"
        ]
    },
    {
        "q": "What is inherited capability set?",
        "o": [
            "Capabilities that can be inherited from parent process on exec now",
            "Inherited set containing capabilities passed through fork operation",
            "Capability inheritance for granting child processes root access here",
            "Set of capabilities inherited from system configuration on boot"
        ]
    },
    {
        "q": "What is permitted capability set?",
        "o": [
            "Maximum capabilities thread is allowed to have in effective set now",
            "Permitted set granting full root capabilities to any process here",
            "Capability set permitted for processes in unprivileged namespace",
            "Set of capabilities that require explicit permission to activate"
        ]
    },
    {
        "q": "What is effective capability set?",
        "o": [
            "Currently active capabilities used for permission checks by kernel now",
            "Effective set containing all possible capabilities on the system here",
            "Capability set that effectively disables all security restrictions now",
            "Set of capabilities that take effect after next process restart"
        ]
    },
    {
        "q": "What is netlink socket exploitation?",
        "o": [
            "Abusing netlink interfaces for kernel communication and manipulation",
            "Network link sockets providing encrypted kernel communication channel",
            "Netlink exploitation requiring administrative access for socket bind",
            "Socket exploitation technique for reading network routing tables now"
        ]
    },
    {
        "q": "What is ptrace_scope setting?",
        "o": [
            "Controls which processes can ptrace others for debugging security now",
            "PTRACE scope setting determining trace log verbosity on the system",
            "Scope setting for limiting process tracing to same user only here",
            "Process trace scope is always set to allow all by default on Linux"
        ]
    },
    {
        "q": "What is dmesg_restrict setting?",
        "o": [
            "Controls whether unprivileged users can read kernel log messages now",
            "DMESG restriction preventing kernel from writing log messages here",
            "Restrict setting for limiting dmesg output to last hundred lines",
            "Message restrict configuration for filtering sensitive kernel logs"
        ]
    },
    {
        "q": "What is kptr_restrict setting?",
        "o": [
            "Controls exposure of kernel pointer addresses to unprivileged users now",
            "Kernel pointer restriction for preventing KASLR configuration changes",
            "Restrict setting blocking kernel pointer arithmetic in exploits here",
            "KPTR restriction prevents kernel from exposing stack trace on crash"
        ]
    },
    {
        "q": "What is perf_event_paranoid setting?",
        "o": [
            "Controls access to performance monitoring subsystem for exploitation now",
            "Perf paranoid setting enabling detailed performance logging for root",
            "Event paranoid configuration for filtering performance data leakage",
            "Paranoid setting preventing all performance monitoring on system"
        ]
    },
    {
        "q": "What is unprivileged_bpf_disabled setting?",
        "o": [
            "Controls whether unprivileged users can use BPF programs for attacks",
            "BPF disabling setting preventing kernel from loading any BPF code now",
            "Unprivileged setting for disabling BPF filtering in network stack",
            "BPF disabled configuration blocking all packet filtering on system"
        ]
    },
    {
        "q": "What is unprivileged_userns_clone setting?",
        "o": [
            "Controls unprivileged user namespace creation used in exploits now",
            "Namespace clone setting for preventing container creation by users",
            "Userns cloning configuration for replicating namespaces across hosts",
            "Clone setting that disables fork operation for unprivileged users"
        ]
    },
    {
        "q": "What is kernel.modules_disabled setting?",
        "o": [
            "Once set prevents loading any additional kernel modules for security",
            "Module disable setting for unloading all non essential modules now",
            "Disabled setting preventing kernel from loading any driver code here",
            "Kernel modules automatically disabled in secure boot configuration"
        ]
    },
    {
        "q": "What is /proc/kallsyms?",
        "o": [
            "Contains kernel symbol addresses useful for exploit development now",
            "Kallsyms file storing encrypted kernel symbols for secure lookup",
            "Kernel symbols file accessible only to root user by default here",
            "Symbol table for all loaded applications on the running system now"
        ]
    },
    {
        "q": "What is /boot/vmlinuz?",
        "o": [
            "Compressed kernel image useful for static analysis and gadget finding",
            "Boot configuration file containing GRUB settings for kernel loading",
            "VM Linux zone file for virtual machine kernel configuration setup",
            "Boot zone file storing encrypted kernel source code for compilation"
        ]
    },
    {
        "q": "What is /boot/System.map?",
        "o": [
            "Symbol table file mapping kernel addresses to symbol names for exploits",
            "System mapping file containing hardware configuration for boot now",
            "Boot map file storing encrypted kernel encryption keys for security",
            "Map file listing system partitions and mount points during boot"
        ]
    },
    {
        "q": "What is gdb kernel debugging?",
        "o": [
            "Using GDB to debug kernel for vulnerability research and exploit dev now",
            "GDB kernel mode automatically provides root access for debugging here",
            "Kernel debugging through GDB requires physical serial connection now",
            "Debugging kernel is disabled on all production systems by default"
        ]
    },
    {
        "q": "What is qemu for kernel exploitation?",
        "o": [
            "Using QEMU emulator to safely test kernel exploits in isolated VM now",
            "QEMU provides direct access to host kernel for exploitation testing",
            "Kernel emulation through QEMU automatically grants root in guest here",
            "QEMU exploitation allowing escape from guest VM to host system now"
        ]
    },
    {
        "q": "What is kASAN?",
        "o": [
            "Kernel address sanitizer for detecting memory bugs during development now",
            "KASAN provides kernel address space analysis for security auditing",
            "Address sanitizer preventing exploitation of memory corruption bugs",
            "Kernel ASan automatically patches memory vulnerabilities at runtime"
        ]
    },
    {
        "q": "What is UBSAN?",
        "o": [
            "Undefined behavior sanitizer detecting bugs that could be exploitable now",
            "UBSAN provides universal binary sanitization for secure kernel builds",
            "Undefined sanitizer blocking undefined behavior automatically here",
            "Binary sanitizer ensuring all kernel binaries are correctly signed"
        ]
    },
    {
        "q": "What is KCFI protection?",
        "o": [
            "Kernel control flow integrity preventing function pointer hijacking now",
            "KCFI provides kernel configuration file integrity verification here",
            "Control flow checker ensuring kernel follows correct execution path",
            "Integrity protection preventing kernel configuration modifications"
        ]
    },
    {
        "q": "What is sysfs exploitation?",
        "o": [
            "Abusing sysfs entries to trigger kernel functionality for exploitation",
            "Sysfs provides read only access to kernel internal state only now",
            "System filesystem exploitation requiring pre-existing root access here",
            "FS exploitation technique for bypassing filesystem access controls"
        ]
    },
    {
        "q": "What is debugfs exploitation?",
        "o": [
            "Abusing debug filesystem for kernel information disclosure or exploits",
            "Debugfs provides secure debugging interface with access controls now",
            "Debug filesystem requires CAP_SYS_ADMIN blocking unprivileged access",
            "FS debugging technique for analyzing kernel crash dump files here"
        ]
    },
    {
        "q": "What is configfs exploitation?",
        "o": [
            "Abusing configuration filesystem for kernel object manipulation now",
            "Configfs provides read only access to kernel configuration data here",
            "Configuration filesystem requires root for any operations on Linux",
            "FS config exploitation for modifying boot parameters on next start"
        ]
    },
    {
        "q": "What is a kernel information leak?",
        "o": [
            "Disclosure of kernel addresses or data useful for further exploitation",
            "Information leak causing kernel to write sensitive data to log files",
            "Kernel leak automatically detected and blocked by memory protection",
            "Leak vulnerability allowing kernel memory to be read from user space"
        ]
    },
    {
        "q": "What is Spectre vulnerability?",
        "o": [
            "Speculative execution side channel allowing kernel memory disclosure now",
            "Spectre attack causing system crash through processor overheating here",
            "Vulnerability in spectrum analyzer component of network stack on host",
            "Spectre is mitigated on all modern CPUs preventing any exploitation"
        ]
    },
    {
        "q": "What is Meltdown vulnerability?",
        "o": [
            "CPU vulnerability allowing reading kernel memory from user space now here",
            "Meltdown attack causing memory corruption through thermal throttling",
            "Vulnerability in memory allocation causing gradual performance decay",
            "Meltdown is Intel specific and does not affect AMD or ARM processors"
        ]
    },
    {
        "q": "What is setuid emulation in containers?",
        "o": [
            "Containers may allow setuid behavior that could be exploited for escape",
            "Setuid is completely disabled in all container environments by default",
            "Emulation of setuid provides same security guarantees as native exec",
            "Setuid container emulation requires running container as root user"
        ]
    },
    {
        "q": "What is binfmt_misc exploitation?",
        "o": [
            "Abusing binary format misc handler for executing arbitrary programs now",
            "Binary format handler is root only preventing unprivileged access here",
            "Misc format exploitation for reading binary configuration from kernel",
            "Format handler automatically escapes special characters in binaries"
        ]
    },
    {
        "q": "What is pty allocation vulnerability?",
        "o": [
            "PTY allocation bugs allowing container escape through terminal handling",
            "Pseudo terminal allocation is fully sandboxed in container contexts",
            "PTY vulnerability causing terminal lockup and denial of service only",
            "Terminal allocation exploit requiring physical access to console now"
        ]
    },
    {
        "q": "What is cgroup device rules bypass?",
        "o": [
            "Bypassing device access controls to interact with restricted devices now",
            "Device rules are enforced at hardware level preventing any bypass here",
            "Cgroup bypass requires modification of cgroup configuration files now",
            "Device bypass technique using symlinks to access blocked device nodes"
        ]
    },
    {
        "q": "What is proc filesystem exploitation?",
        "o": [
            "Abusing proc entries for information disclosure or kernel manipulation",
            "Proc filesystem is read only preventing any exploitation attempts now",
            "FS exploitation requiring pre-existing elevated privileges on system",
            "Process filesystem exploitation for reading memory of other processes"
        ]
    },
    {
        "q": "What is /proc/self/mem exploitation?",
        "o": [
            "Reading or writing process memory through proc mem interface for attacks",
            "Self memory file is protected by permission checks on all Linux systems",
            "Proc mem exploitation requires administrator privileges for access now",
            "Memory file provides encrypted representation of process memory only"
        ]
    },
    {
        "q": "What is /proc/self/fd exploitation?",
        "o": [
            "Accessing file descriptors to recover deleted files or bypass restrictions",
            "FD directory only shows file descriptor numbers without access to files",
            "Proc fd exploitation requires pre-existing file permissions on target",
            "File descriptor access is fully sandboxed preventing exploitation now"
        ]
    },
    {
        "q": "What is O_PATH file descriptor exploitation?",
        "o": [
            "Using O_PATH opened descriptors to bypass certain path restrictions now",
            "O_PATH file descriptors are read only preventing write operations here",
            "Path descriptor exploitation is mitigated by kernel security checks now",
            "PATH opening mode provides full access to file contents and metadata"
        ]
    },
    {
        "q": "What is memfd exploitation?",
        "o": [
            "Using memory file descriptors for fileless payload execution in memory",
            "Memfd is restricted to root users preventing unprivileged exploitation",
            "Memory fd provides encrypted memory regions inaccessible to exploits",
            "FD memory exploitation for reading kernel memory from user process"
        ]
    },
    {
        "q": "What is shm_open exploitation?",
        "o": [
            "Abusing shared memory for code injection or information sharing attacks",
            "Shared memory opening requires elevated privileges on all Linux systems",
            "SHM exploitation is blocked by mandatory access control by default now",
            "Memory sharing through shm_open is fully isolated between processes"
        ]
    },
    {
        "q": "What is signal handler exploitation?",
        "o": [
            "Abusing signal delivery to race with kernel for privilege escalation now",
            "Signal handlers are protected and cannot be exploited by unprivileged users",
            "Handler exploitation requires pre-existing access to target process code",
            "Signal exploitation for triggering kernel panic and denial of service"
        ]
    },
    {
        "q": "What is SIGKILL signal handler abuse?",
        "o": [
            "SIGKILL cannot be caught so not directly exploitable for code execution",
            "Signal kill handlers allow executing code before process termination now",
            "SIGKILL abuse requires root privileges to send the signal to processes",
            "Kill signal exploitation triggers kernel mode execution in handler code"
        ]
    },
    {
        "q": "What is Unix domain socket exploitation?",
        "o": [
            "Abusing socket permissions or passing file descriptors for escalation now",
            "Unix domain sockets are protected by network level access controls here",
            "Socket exploitation requires administrative network configuration access",
            "Domain socket attacks only work against network facing services on host"
        ]
    },
    {
        "q": "What is SCM_RIGHTS exploitation?",
        "o": [
            "Passing file descriptors through unix socket for privilege bypass now",
            "SCM rights provide secure credential management for socket connections",
            "Rights passing requires pre-existing elevated permissions on socket here",
            "Socket rights exploitation reveals all connection credentials to user"
        ]
    },
    {
        "q": "What is abstract unix socket vulnerability?",
        "o": [
            "Abstract sockets bypass filesystem permissions for network namespace access",
            "Abstract sockets are isolated and cannot be accessed across namespaces",
            "Socket vulnerability requiring modification of abstract socket path now",
            "Unix abstract paths provide authenticated access to socket endpoints"
        ]
    },
    {
        "q": "What is kernel keyring exploitation?",
        "o": [
            "Abusing keyring subsystem for information disclosure or escalation now",
            "Keyring provides secure key storage inaccessible to exploitation here",
            "Key exploitation requires direct access to kernel memory structures now",
            "Keyring attacks only affect encrypted filesystem key management on host"
        ]
    },
    {
        "q": "What is join_session_keyring exploitation?",
        "o": [
            "CVE-2016-0728 allowing privilege escalation through keyring reference count",
            "Session keyring joining requires administrative privileges for access now",
            "Keyring exploitation causing denial of service through memory exhaustion",
            "Join vulnerability exposing session keys to all processes in same group"
        ]
    },
    {
        "q": "What is Linux audit bypass technique?",
        "o": [
            "Avoiding audit logging through various methods during exploitation now",
            "Audit system cannot be bypassed requiring complete kernel compromise",
            "Bypass technique requiring modification of audit daemon configuration",
            "Audit bypass automatically disabled when SELinux is in enforcing mode"
        ]
    },
    {
        "q": "What is /dev/mem exploitation?",
        "o": [
            "Reading or writing physical memory for kernel exploitation attacks now",
            "Device memory file is read only preventing write based exploitation here",
            "Mem exploitation automatically blocked by secure boot on all systems now",
            "Memory device provides access to device registers not system memory"
        ]
    },
    {
        "q": "What is /dev/kmem exploitation?",
        "o": [
            "Accessing kernel virtual memory for reading or modifying kernel data now",
            "Kmem device is disabled on all modern Linux distributions by default now",
            "Kernel memory device only available in debug kernel configurations here",
            "Memory exploitation through kmem requires physical system access now"
        ]
    },
    {
        "q": "What is X11 display hijacking?",
        "o": [
            "Accessing X server to capture keystrokes or inject input for escalation",
            "X11 display protection prevents unauthorized access from other users now",
            "Display hijacking requires graphical user interface session on system",
            "X server exploitation is blocked by Wayland display protocol on desktops"
        ]
    },
    {
        "q": "What is Wayland security improvement?",
        "o": [
            "Wayland provides better application isolation than X11 preventing attacks",
            "Wayland automatically grants root permissions for privileged operations",
            "Display protocol security is identical between Wayland and X11 systems",
            "Wayland disables all application communication preventing data sharing"
        ]
    },
    {
        "q": "What is D-Bus exploitation?",
        "o": [
            "Abusing misconfigured D-Bus services for privilege escalation on desktop",
            "D-Bus provides secure inter-process communication preventing exploitation",
            "Bus exploitation requires modification of dbus daemon configuration file",
            "D-Bus attacks only work against graphical desktop applications on system"
        ]
    },
    {
        "q": "What is polkit D-Bus exploitation?",
        "o": [
            "Exploiting polkit bugs via D-Bus for authentication bypass to root now",
            "PolicyKit D-Bus interface is protected and cannot be directly exploited",
            "D-Bus polkit exploitation requiring pre-existing administrator access here",
            "Polkit attacks through D-Bus are blocked by AppArmor by default on Linux"
        ]
    },
    {
        "q": "What is systemd-machined exploitation?",
        "o": [
            "Exploiting machine container service for host access or privilege escalation",
            "Machined service runs with reduced privileges preventing exploitation now",
            "Systemd machine exploitation requires running pods with privileged access",
            "Container service is isolated and cannot access host system resources"
        ]
    },
    {
        "q": "What is systemd-networkd exploitation?",
        "o": [
            "Exploiting network daemon for network configuration or DHCP attacks now",
            "Networkd exploitation requires administrative access to network namespace",
            "Network daemon is sandboxed preventing any privilege escalation attacks",
            "Systemd network exploitation only affects network configuration state"
        ]
    },
    {
        "q": "What is snapd privilege escalation?",
        "o": [
            "Exploiting snap daemon bugs for local privilege escalation to root now",
            "Snap packages run in sandbox preventing any privilege escalation here",
            "Snapd exploitation requiring modification of snap package definitions now",
            "Daemon escalation blocked by mandatory confinement on Ubuntu systems"
        ]
    },
    {
        "q": "What is dirty_sock exploit?",
        "o": [
            "CVE-2019-7304 exploiting snapd API for local privilege escalation to root",
            "Sock exploitation requiring network access to snap daemon on system now",
            "Dirty socket vulnerability causing denial of service through resource leak",
            "Snap socket exploit only works on systems running snap in debug mode"
        ]
    },
    {
        "q": "What is flatpak sandbox escape?",
        "o": [
            "Breaking out of flatpak sandbox to access host system or escalate privileges",
            "Flatpak sandbox is escape-proof providing complete application isolation",
            "Sandbox escape requiring modification of flatpak manifest file on host",
            "Flatpak escapes only possible when running applications as root user"
        ]
    },
    {
        "q": "What is AppImage exploitation?",
        "o": [
            "AppImages run without sandbox making SUID or FUSE attacks possible now",
            "AppImage format provides secure application isolation by default on Linux",
            "Image exploitation requires elevated privileges to mount the appimage file",
            "Application image attacks blocked by filesystem mount restrictions here"
        ]
    },
    {
        "q": "What is SSH agent hijacking?",
        "o": [
            "Accessing SSH agent socket to use stored keys for lateral movement now",
            "SSH agent sockets are protected by authentication token requirements here",
            "Agent hijacking requires network access to SSH daemon on the system now",
            "SSH agent stores keys in encrypted memory inaccessible to other processes"
        ]
    },
    {
        "q": "What is SSH agent forwarding attack?",
        "o": [
            "Compromising forwarded agent to use keys on subsequent systems in chain",
            "Agent forwarding is encrypted preventing man in the middle attacks now here",
            "Forwarding attack requiring modification of SSH client configuration file",
            "SSH forwarding protects against all key theft attacks automatically now"
        ]
    },
    {
        "q": "What is GNOME keyring exploitation?",
        "o": [
            "Accessing keyring daemon for stored passwords or keys on desktop now",
            "GNOME keyring encrypts all secrets with inaccessible session key here",
            "Keyring exploitation requiring modification of keyring daemon config file",
            "Desktop keyring only accessible to applications with explicit permission"
        ]
    },
    {
        "q": "What is KDE wallet exploitation?",
        "o": [
            "Accessing KWallet for stored secrets on KDE desktop environment now here",
            "KDE wallet protects all secrets with hardware security module encryption",
            "Wallet exploitation requiring administrative privileges for access now",
            "KWallet isolates secrets between applications preventing any access"
        ]
    },
    {
        "q": "What is screen session hijacking?",
        "o": [
            "Attaching to others screen sessions for credential theft or escalation now",
            "Screen sessions are protected and cannot be attached to by other users",
            "Session hijacking requiring modification of screen socket permissions here",
            "Screen automatically terminates session when different user attaches now"
        ]
    },
    {
        "q": "What is tmux session hijacking?",
        "o": [
            "Accessing tmux sockets to attach to session and view or interact terminal",
            "Tmux sockets use strict permissions preventing unauthorized attachment now",
            "Session hijacking requiring modification of tmux server configuration file",
            "Terminal multiplexer sessions are isolated between user accounts always"
        ]
    },
    {
        "q": "What is ptrace credential theft?",
        "o": [
            "Using ptrace to read memory of process running as target user for secrets",
            "PTRACE scope restrictions prevent reading memory of other user processes",
            "Credential theft requiring administrative privileges for ptrace system call",
            "Process tracing automatically encrypted preventing credential visibility"
        ]
    },
    {
        "q": "What is sudo token reuse attack?",
        "o": [
            "Exploiting sudo timestamp to run commands without reauthentication now",
            "Sudo tokens are tied to terminal and cannot be reused by other sessions",
            "Token reuse requiring modification of sudo timestamp file on filesystem",
            "Sudo authentication always requires password regardless of timestamp state"
        ]
    },
    {
        "q": "What is tty pushback attack?",
        "o": [
            "Injecting commands into terminal when privileged user returns from sudo now",
            "TTY pushback is blocked by modern terminal emulators on all systems here",
            "Pushback attack requiring modification of terminal configuration settings",
            "Terminal injection only works against deprecated terminal types on system"
        ]
    },
    {
        "q": "What is LD_AUDIT exploitation?",
        "o": [
            "Using LD_AUDIT to load library with audit hooks for code execution now here",
            "AUDIT environment is filtered by dynamic linker for SUID binaries always",
            "Library audit exploitation requiring modification of linker configuration",
            "Audit libraries run with reduced privileges preventing privilege escalation"
        ]
    },
    {
        "q": "What is RPATH exploitation?",
        "o": [
            "Exploiting RPATH in binaries to load malicious libraries from writable path",
            "RPATH settings are protected and cannot be modified by unprivileged users",
            "Path exploitation requiring write access to system library directories now",
            "Binary RPATH values are validated before use preventing exploitation here"
        ]
    },
    {
        "q": "What is RUNPATH exploitation?",
        "o": [
            "Similar to RPATH exploiting library search path in binary for injection now",
            "RUNPATH is more secure than RPATH preventing library injection attacks",
            "Path exploitation requiring modification of binary ELF headers directly now",
            "Run path values are reset to defaults when running SUID binaries on Linux"
        ]
    },
    {
        "q": "What is .so preloading through configuration?",
        "o": [
            "Adding library to /etc/ld.so.preload for system-wide code injection now",
            "Preload configuration is root only but persists across all process executions",
            "SO preloading through configuration blocked by secure boot on all systems",
            "Library preload file is checked for integrity before loading any libraries"
        ]
    },
    {
        "q": "What is LD.SO cache poisoning?",
        "o": [
            "Modifying ldconfig cache to redirect library resolution for code injection",
            "Library cache is protected and cannot be modified by unprivileged users now",
            "Cache poisoning requiring modification of ld.so.conf configuration file here",
            "Dynamic linker validates cache entries preventing poisoning attacks always"
        ]
    },
    {
        "q": "What is glibc vulnerability exploitation?",
        "o": [
            "Exploiting bugs in C library for local privilege escalation on the system now",
            "GLIBC is security audited and contains no exploitable vulnerabilities here",
            "Library vulnerability requiring specific application configurations for exploit",
            "C library bugs only cause denial of service without privilege escalation"
        ]
    },
    {
        "q": "What is PAM exploitation?",
        "o": [
            "Exploiting PAM module bugs or misconfigurations for authentication bypass now",
            "PAM modules run with reduced privileges preventing escalation attacks here",
            "Authentication exploitation requiring modification of pam configuration file",
            "Pluggable authentication is isolated and cannot affect system security now"
        ]
    },
    {
        "q": "What is PAM module hijacking?",
        "o": [
            "Replacing or adding PAM module to intercept credentials or bypass auth now",
            "PAM modules are integrity checked before loading preventing replacement here",
            "Module hijacking requiring pre-existing root access to modify pam directory",
            "PAM paths are hardcoded and cannot be changed by configuration modifications"
        ]
    },
    {
        "q": "What is NSS exploitation?",
        "o": [
            "Exploiting name service switch bugs for code execution as root user now here",
            "NSS libraries are security hardened preventing exploitation attempts always",
            "Service switch exploitation requiring modification of nsswitch.conf file now",
            "Name services run in isolated namespace preventing privilege escalation"
        ]
    },
    {
        "q": "What is nscd exploitation?",
        "o": [
            "Exploiting name service cache daemon bugs for local privilege escalation now",
            "NSCD runs with reduced privileges preventing any escalation attacks here",
            "Cache daemon exploitation requiring network access to nscd socket on host",
            "Name service caching is disabled by default on most Linux distributions"
        ]
    },
    {
        "q": "What is LDAP client exploitation?",
        "o": [
            "Exploiting LDAP library bugs for code execution during name resolution now",
            "LDAP client libraries are security audited preventing exploitation here",
            "Client exploitation requiring malicious LDAP server under attacker control",
            "Directory client runs in sandbox preventing privilege escalation attacks"
        ]
    },
    {
        "q": "What is Kerberos credential theft?",
        "o": [
            "Stealing Kerberos tickets from ccache for lateral movement in domain now",
            "Kerberos credentials are encrypted and cannot be stolen from memory here",
            "Credential theft requiring administrative access to ticket cache file now",
            "Kerberos tickets automatically expire preventing long term credential abuse"
        ]
    },
    {
        "q": "What is keytab file exploitation?",
        "o": [
            "Using readable keytab file to authenticate as service principal for access now",
            "Keytab files are encrypted and require secret key for decryption first here",
            "Tab file exploitation requiring modification of Kerberos configuration now",
            "Service keytabs only allow access to resources owned by that service user"
        ]
    },
    {
        "q": "What is SSSD exploitation?",
        "o": [
            "Exploiting system security services daemon bugs for privilege escalation now",
            "SSSD runs with reduced privileges in sandbox preventing escalation here",
            "Services daemon exploitation requiring modification of sssd configuration now",
            "Security services are isolated from main system preventing lateral access"
        ]
    },
    {
        "q": "What is logrotate exploitation?",
        "o": [
            "Exploiting logrotate race conditions to write files as root user now here",
            "Log rotation runs atomically preventing any race condition exploitation",
            "Rotate exploitation requiring pre-existing write access to log directory now",
            "Logrotate is replaced by journald on modern systems preventing exploitation"
        ]
    },
    {
        "q": "What is cron.allow and cron.deny?",
        "o": [
            "Files controlling which users can create cron jobs for access restriction now",
            "Allow and deny files determine cron job execution privileges on system here",
            "Cron access files contain passwords for scheduled task authentication now",
            "Allow list automatically grants root cron privileges to listed users only"
        ]
    },
    {
        "q": "What is at jobs exploitation?",
        "o": [
            "Scheduling one time jobs that may run with elevated privileges for escalation",
            "At daemon runs all jobs in sandbox preventing privilege escalation here now",
            "Job exploitation requiring modification of at daemon configuration file now",
            "Scheduled jobs always inherit caller privileges without escalation possible"
        ]
    },
    {
        "q": "What is systemd timer exploitation?",
        "o": [
            "Abusing writable timer units to execute code with elevated privileges now",
            "Systemd timers run in user context preventing root escalation attacks here",
            "Timer exploitation requiring modification of systemd daemon configuration",
            "Timer units are integrity checked before execution preventing tampering now"
        ]
    },
    {
        "q": "What is transient service exploitation?",
        "o": [
            "Creating systemd-run transient services for privilege escalation attacks now",
            "Transient services run with caller privileges only preventing escalation here",
            "Service exploitation requiring pre-existing administrative privileges on host",
            "Transient units are disabled in production systemd configurations always"
        ]
    },
    {
        "q": "What is user service exploitation?",
        "o": [
            "Exploiting user level systemd services for persistent access or escalation now",
            "User services run in isolated namespace preventing any system access here",
            "Service exploitation requiring modification of user systemd directories now",
            "User level services cannot interact with system services on the host now"
        ]
    },
    {
        "q": "What is XDG autostart exploitation?",
        "o": [
            "Placing scripts in autostart directory for code execution at login time now",
            "Autostart directories are protected and cannot be written by other users here",
            "XDG exploitation requiring modification of desktop environment settings now",
            "Autostart scripts run in sandbox preventing system privilege escalation"
        ]
    },
    {
        "q": "What is .profile exploitation?",
        "o": [
            "Adding commands to profile that execute when user logs in to shell now here",
            "Profile files are protected and cannot be modified by other users on system",
            "Profile exploitation requiring modification of shell invocation parameters now",
            "Shell profile scripts run in restricted mode preventing privilege changes"
        ]
    },
    {
        "q": "What is .bashrc exploitation?",
        "o": [
            "Adding malicious commands that execute on every new bash shell spawn now",
            "Bashrc files run in restricted context preventing privilege escalation here",
            "Bash configuration exploitation requiring modification of bash binary itself",
            "RC files are integrity checked before sourcing preventing modifications now"
        ]
    },
    {
        "q": "What is .ssh/rc exploitation?",
        "o": [
            "Adding commands to ssh rc that run on every SSH login for persistence now",
            "SSH rc files are disabled by default on all modern Linux distributions here",
            "RC exploitation requiring modification of ssh daemon configuration file now",
            "SSH restricts rc execution to non privileged commands only for security"
        ]
    },
    {
        "q": "What is MotD exploitation?",
        "o": [
            "Abusing message of the day scripts that run with root on user login now here",
            "MotD scripts run as login user without any privilege escalation possible",
            "Message exploitation requiring modification of pam motd module settings now",
            "Dynamic MotD is disabled on most Linux distributions for security reasons"
        ]
    },
    {
        "q": "What is update-motd exploitation?",
        "o": [
            "Exploiting writable update-motd.d scripts for root code execution at login",
            "Update motd scripts run with caller privileges preventing escalation here now",
            "MotD update exploitation requiring modification of motd daemon settings now",
            "Message scripts are integrity checked before execution preventing tampering"
        ]
    },
    {
        "q": "What is package manager exploitation?",
        "o": [
            "Exploiting apt dpkg rpm hooks or scripts for privilege escalation to root now",
            "Package managers run with reduced privileges preventing escalation here now",
            "Manager exploitation requiring modification of package repository settings now",
            "Package installation is sandboxed preventing arbitrary code execution now"
        ]
    },
    {
        "q": "What is dpkg trigger exploitation?",
        "o": [
            "Triggering dpkg interest triggers to execute arbitrary code as root user now",
            "Package triggers run as package user without any system privileges here now",
            "Trigger exploitation requiring modification of dpkg database files on system",
            "DPKG validates all triggers before execution preventing exploitation always"
        ]
    },
    {
        "q": "What is pip package exploitation?",
        "o": [
            "Installing malicious pip package that runs setup code as installing user now",
            "Python packages run in sandbox preventing any privilege escalation here now",
            "Package exploitation requiring administrative access to pip configuration now",
            "Pip validates all packages before installation preventing malicious code"
        ]
    },
    {
        "q": "What is npm package exploitation?",
        "o": [
            "Installing npm package with malicious install scripts for code execution now",
            "Node packages run in isolated context preventing file system access here now",
            "Package exploitation requiring modification of npm registry settings on host",
            "NPM validates package signatures before installation on all systems always"
        ]
    },
    {
        "q": "What is gem package exploitation?",
        "o": [
            "Installing malicious gem package that executes code during installation now",
            "Ruby gems run in sandbox preventing privilege escalation attacks here now",
            "Gem exploitation requiring administrative access to gem configuration files",
            "Rubygems validates all packages against central registry before installation"
        ]
    },
    {
        "q": "What is cargo package exploitation?",
        "o": [
            "Malicious crate running build.rs script during compilation for code exec now",
            "Rust packages run in sandbox preventing file system access during build here",
            "Cargo exploitation requiring modification of crates.io registry settings now",
            "Build scripts are disabled by default in cargo for security purposes always"
        ]
    },
    {
        "q": "What is virtualenv exploitation?",
        "o": [
            "Planting malicious activate scripts in virtual environments for execution now",
            "Virtual environments run with reduced privileges preventing escalation here",
            "Env exploitation requiring modification of python interpreter settings on host",
            "Virtualenv validates activate scripts before sourcing them for activation"
        ]
    },
    {
        "q": "What is conda environment exploitation?",
        "o": [
            "Placing malicious scripts in conda environment activation hooks for exec now",
            "Conda environments run in sandbox preventing privilege escalation attacks",
            "Environment exploitation requiring modification of conda base configuration",
            "Activation scripts are checked for malicious content before execution always"
        ]
    },
    {
        "q": "What is git hooks exploitation?",
        "o": [
            "Placing malicious scripts in repository hooks that execute on operations now",
            "Git hooks run in restricted mode preventing file system access outside repo",
            "Hook exploitation requiring modification of git daemon configuration file now",
            "Git validates hook scripts before execution preventing arbitrary code use"
        ]
    },
    {
        "q": "What is git config exploitation?",
        "o": [
            "Abusing git configurations for code execution via external commands option now",
            "Git configuration is validated before use preventing command injection here",
            "Config exploitation requiring modification of global git settings on system",
            "Git ignores configuration in untrusted repositories for security purposes"
        ]
    },
    {
        "q": "What is CVE-2022-24765 git exploit?",
        "o": [
            "Exploiting git safe.directory bypass for code execution via hooks and config",
            "Git directory exploit requiring pre-existing write access to git repository",
            "CVE causing denial of service when processing malformed git object data now",
            "Directory vulnerability is patched on all supported git versions currently"
        ]
    },
    {
        "q": "What is make exploitation?",
        "o": [
            "Planting malicious Makefile that runs as build user during compilation now",
            "Make runs build targets in sandbox preventing privilege escalation attacks",
            "Build exploitation requiring modification of make daemon configuration file",
            "Makefile scripts are validated before execution preventing arbitrary code"
        ]
    },
    {
        "q": "What is cmake exploitation?",
        "o": [
            "CMakeLists.txt can execute arbitrary code during build configuration phase now",
            "CMake runs all scripts in sandbox preventing system access during builds",
            "Build system exploitation requiring modification of cmake configuration files",
            "CMake validates project files before processing preventing code execution"
        ]
    },
    {
        "q": "What is editor plugin exploitation?",
        "o": [
            "Installing malicious vim or emacs plugins that run with user privileges now",
            "Editor plugins run in sandbox preventing file system access outside editor",
            "Plugin exploitation requiring modification of plugin repository settings now",
            "Editors validate plugin code before installation preventing malicious plugins"
        ]
    },
    {
        "q": "What is vimrc exploitation?",
        "o": [
            "Planting malicious vimrc that executes when user runs vim in directory now",
            "Vim ignores untrusted vimrc files in current directory by default for safety",
            "RC exploitation requiring modification of vim binary to load local config now",
            "Vim validates all rc file commands before execution for security purposes"
        ]
    },
    {
        "q": "What is exrc exploitation in vim?",
        "o": [
            "Using directory specific exrc to execute vim commands when opening files now",
            "Exrc is disabled by default requiring explicit enable in global config now here",
            "RC exploitation causing vim crash when processing malformed exrc file content",
            "Editor restricts exrc commands to safe subset preventing code execution now"
        ]
    },
    {
        "q": "What is modeline exploitation in vim?",
        "o": [
            "Embedding vim commands in file modelines for code execution upon opening now",
            "Modelines only support display options preventing command execution attacks",
            "Modeline exploitation requiring enabling of unsafe modeline options first",
            "Vim validates modeline content before applying preventing malicious commands"
        ]
    },
    {
        "q": "What is less lF exploitation?",
        "o": [
            "Using LESSOPEN or LESSCLOSE for code execution when viewing files with less",
            "Less viewer filters are disabled by default on all modern distributions now",
            "File exploitation requiring modification of less configuration file on system",
            "Less validates filter commands before execution preventing code injection"
        ]
    },
    {
        "q": "What is tar wildcard expansion attack?",
        "o": [
            "Using filenames that look like tar arguments to inject commands in extraction",
            "Tar validates all filenames preventing argument injection attacks on extract",
            "Wildcard exploitation requiring specific tar options not used by default now",
            "Tar ignores special characters in filenames during extraction operations"
        ]
    },
    {
        "q": "What is rsync exploitation?",
        "o": [
            "Abusing rsync wildcards or symlinks for privilege escalation attacks now here",
            "Rsync follows symlinks safely preventing directory traversal attacks always",
            "Sync exploitation requiring modification of rsync daemon configuration file",
            "File synchronization is sandboxed preventing access outside specified paths"
        ]
    },
    {
        "q": "What is command injection in shell scripts?",
        "o": [
            "Exploiting unquoted variables in scripts for arbitrary command execution now",
            "Shell scripts automatically escape special characters in all variables here",
            "Injection exploitation requiring modification of shell binary on the system",
            "Scripts run in restricted mode preventing command injection attacks always"
        ]
    },
    {
        "q": "What is IFS exploitation?",
        "o": [
            "Manipulating internal field separator for word splitting code injection now",
            "IFS is protected environment variable that cannot be modified by users here",
            "Field separator exploitation requiring modification of shell settings file",
            "Shells reset IFS to defaults before processing any user input for security"
        ]
    },
    {
        "q": "What is globbing attack in shell?",
        "o": [
            "Using glob patterns in filenames to inject arguments into commands now here",
            "Shell validates glob patterns before expansion preventing injection attacks",
            "Globbing exploitation requiring modification of shell expansion settings now",
            "Filename patterns are quoted before use preventing glob based injection"
        ]
    },
    {
        "q": "What is sudo env_keep exploitation?",
        "o": [
            "Exploiting environment variables preserved through sudo for code injection now",
            "Env_keep only allows safe variables that cannot be exploited for escalation",
            "Keep exploitation requiring modification of sudoers file for environment add",
            "Sudo sanitizes all preserved variables before passing to target command"
        ]
    },
    {
        "q": "What is PYTHONPATH exploitation?",
        "o": [
            "Setting PYTHONPATH to load malicious modules when python script runs as root",
            "Python path is sanitized for SUID or privileged script execution always now",
            "Path exploitation requiring modification of python interpreter binary file",
            "Python validates all imported modules preventing malicious code loading now"
        ]
    },
    {
        "q": "What is PERL5LIB exploitation?",
        "o": [
            "Setting PERL5LIB to load malicious Perl modules for code execution attacks now",
            "Perl library path is ignored for SUID script execution for security purposes",
            "Lib exploitation requiring modification of Perl interpreter configuration now",
            "Perl validates all library paths before loading any modules from them here"
        ]
    },
    {
        "q": "What is RUBYLIB exploitation?",
        "o": [
            "Setting RUBYLIB to load malicious Ruby libraries for code injection attacks now",
            "Ruby library path is sanitized for privileged script execution always here",
            "Lib exploitation requiring modification of Ruby interpreter binary file on host",
            "Ruby validates library paths before loading external modules for security"
        ]
    },
    {
        "q": "What is NODE_PATH exploitation?",
        "o": [
            "Setting NODE_PATH to load malicious Node.js modules for code execution now",
            "Node path is protected and cannot be used for privilege escalation attacks",
            "Path exploitation requiring modification of node interpreter settings file now",
            "Node.js validates module paths before requiring any external modules here"
        ]
    },
    {
        "q": "What is password reuse attack?",
        "o": [
            "Using found password to access other services or escalate to privileged user",
            "Password reuse is blocked by unique salted hashes for each service on system",
            "Reuse attack requiring modification of authentication configuration files now",
            "Linux enforces unique passwords for each service preventing reuse attacks"
        ]
    },
    {
        "q": "What is horizontal privilege escalation?",
        "o": [
            "Escalating to another users privileges at same or similar level as current now",
            "Horizontal movement is blocked by strict user separation on Linux systems",
            "Privilege expansion requiring modification of user permission database file",
            "Linux prevents access to other user resources regardless of privilege level"
        ]
    },
    {
        "q": "What is token impersonation in Linux?",
        "o": [
            "Using captured credentials or cookies to impersonate privileged services now",
            "Token impersonation requires Windows-like token system not present on Linux",
            "Impersonation requiring modification of authentication daemon configuration",
            "Linux validates all tokens cryptographically preventing impersonation attacks"
        ]
    },
    {
        "q": "What is credential dumping on Linux?",
        "o": [
            "Extracting passwords or hashes from memory files or configuration for reuse now",
            "Credentials are encrypted in memory and cannot be dumped by user processes",
            "Dumping requiring modification of authentication subsystem on the host system",
            "Linux clears credentials from memory immediately after authentication use"
        ]
    },
    {
        "q": "What is kernel ROP chain exploitation?",
        "o": [
            "Chaining return oriented gadgets in kernel to bypass SMEP and execute code now",
            "ROP chains require disabling kernel ASLR before exploitation is possible here",
            "Return oriented attacks are prevented by control flow integrity on Linux now",
            "Kernel ROP only works on systems without stack canaries enabled for protection"
        ]
    },
    {
        "q": "What is JIT spray exploitation?",
        "o": [
            "Exploiting JIT compilers to place controlled code in executable memory pages now",
            "JIT spray attacks only work against interpreted languages without compilation",
            "Spray exploitation requiring modification of just-in-time compiler settings here",
            "JIT protections prevent all spray attacks on modern Linux kernel versions now"
        ]
    },
    {
        "q": "What is eBPF exploitation?",
        "o": [
            "Exploiting extended Berkeley Packet Filter for kernel code execution attacks now",
            "eBPF programs run in user space and cannot escalate kernel privileges here",
            "BPF exploitation requiring pre-existing root access to load BPF programs now",
            "Extended BPF is verified to prevent all malicious code execution attempts"
        ]
    },
    {
        "q": "What is io_uring exploitation?",
        "o": [
            "Exploiting io_uring interface bugs for kernel privilege escalation attacks now",
            "IO uring runs all operations in user space preventing kernel exploitation here",
            "Uring exploitation requiring modification of kernel configuration for access now",
            "IO ring operations are sandboxed preventing any privilege escalation attacks"
        ]
    },
    {
        "q": "What is CVE-2021-41073 io_uring exploit?",
        "o": [
            "Type confusion in io_uring allowing local privilege escalation to root user now",
            "Uring vulnerability causing denial of service without privilege escalation here",
            "IO ring exploit requiring network access to exploit the vulnerability remotely",
            "CVE is patched on all supported kernel versions preventing exploitation now"
        ]
    },
    {
        "q": "What is userfaultfd exploitation?",
        "o": [
            "Using userfaultfd to race with kernel for use-after-free exploitation now here",
            "User fault handling runs in user space without kernel privilege interaction",
            "Faultfd exploitation requiring modification of memory management subsystem now",
            "Userfaultfd is restricted to root preventing unprivileged exploitation attacks"
        ]
    },
    {
        "q": "What is FUSE race condition exploitation?",
        "o": [
            "Racing kernel through FUSE filesystem to exploit time-of-check vulnerabilities",
            "FUSE operations are atomic preventing any race condition exploitation here now",
            "Filesystem racing requiring modification of fuse daemon configuration on host",
            "User space filesystems run in isolated context preventing kernel racing attacks"
        ]
    },
    {
        "q": "What is overlayfs exploitation?",
        "o": [
            "Exploiting overlayfs bugs for container escape or privilege escalation now here",
            "Overlay filesystem runs in sandbox preventing any exploitation attempt always",
            "FS exploitation requiring modification of overlay mount configuration files now",
            "Overlayfs is validated on mount preventing any privilege escalation attacks"
        ]
    },
    {
        "q": "What is CVE-2021-3493 overlayfs exploit?",
        "o": [
            "Capabilities bypass in overlayfs allowing privilege escalation to root user now",
            "Overlay vulnerability causing file corruption without any privilege escalation",
            "FS exploit requiring specific kernel configuration not present by default now",
            "CVE is patched preventing exploitation on all current kernel versions available"
        ]
    },
    {
        "q": "What is netfilter exploitation?",
        "o": [
            "Exploiting netfilter subsystem bugs for local privilege escalation to root now",
            "Network filter runs in isolated context preventing kernel privilege escalation",
            "Filter exploitation requiring administrative access to iptables configuration",
            "Netfilter is security hardened preventing any exploitation attempts on Linux"
        ]
    },
    {
        "q": "What is CVE-2022-25636 nft exploit?",
        "o": [
            "Heap out-of-bounds write in nf_tables for local privilege escalation attacks now",
            "NFT vulnerability causing network disruption without privilege escalation here",
            "Tables exploit requiring pre-existing firewall configuration access on system",
            "CVE is mitigated by default seccomp policies preventing exploitation now"
        ]
    },
    {
        "q": "What is nftables user namespace exploitation?",
        "o": [
            "Exploiting nftables access from unprivileged user namespaces for escalation now",
            "User namespace nftables access is blocked by default on all distributions now",
            "Namespace exploitation requiring modification of namespace security policy here",
            "NFT operations from namespaces run with reduced privileges preventing attacks"
        ]
    },
    {
        "q": "What is core_pattern exploitation?",
        "o": [
            "Modifying core dump handler for code execution on privileged process crash now",
            "Core pattern is read only and cannot be modified by unprivileged users here now",
            "Pattern exploitation requiring pre-existing crash in privileged process first",
            "Core dump handlers run in sandbox preventing privilege escalation attacks"
        ]
    },
    {
        "q": "What is modprobe_path exploitation?",
        "o": [
            "Modifying kernel module path for code execution when unknown module requested",
            "Modprobe path requires root access and only persists until next reboot here now",
            "Path exploitation requiring modification of kernel compile time configuration",
            "Module path is validated before use preventing arbitrary code execution now"
        ]
    },
    {
        "q": "What is kernel module signing bypass?",
        "o": [
            "Techniques to load unsigned kernel modules on systems requiring signatures now",
            "Module signing cannot be bypassed requiring valid key for all module loads here",
            "Signing bypass requiring modification of bootloader secure boot configuration",
            "Kernel validates all signatures cryptographically preventing bypass attempts"
        ]
    },
    {
        "q": "What is kprobes exploitation?",
        "o": [
            "Abusing kernel probes for dynamic kernel modification and backdoor installation",
            "Kprobes require root and are audited preventing malicious use by attackers now",
            "Probe exploitation requiring modification of kernel debug configuration files",
            "Kernel probes run in isolated context preventing any privilege escalation"
        ]
    },
    {
        "q": "What is ftrace exploitation?",
        "o": [
            "Using kernel function tracer for hooking kernel functions for persistence now here",
            "Ftrace requires root access and is monitored by security subsystems always",
            "Trace exploitation requiring modification of debugfs mount configuration now here",
            "Function tracing runs in read only mode preventing any kernel modification"
        ]
    },
    {
        "q": "What is perf_event exploitation?",
        "o": [
            "Exploiting perf subsystem bugs for information disclosure or privilege escalation",
            "Perf events run in isolated context preventing any kernel privilege access now",
            "Event exploitation requiring modification of perf daemon configuration file here",
            "Performance subsystem is security audited preventing all exploitation attempts"
        ]
    },
    {
        "q": "What is BPF trampoline attack?",
        "o": [
            "Using BPF trampolines for kernel code execution bypassing protection mechanisms",
            "Trampoline attacks require loading BPF which is restricted to root users now",
            "Attack requiring modification of BPF verifier to bypass security checks here now",
            "BPF trampolines are validated preventing arbitrary code execution in kernel"
        ]
    },
    {
        "q": "What is unprivileged BPF exploitation?",
        "o": [
            "Exploiting unprivileged BPF access for kernel exploitation without root access",
            "Unprivileged BPF is disabled by default on most modern Linux distributions now",
            "BPF exploitation requiring re-enabling unprivileged access via sysctl changes",
            "User BPF programs are verified preventing any kernel exploitation attempts"
        ]
    },
    {
        "q": "What is CVE-2021-31440 BPF exploit?",
        "o": [
            "Bounds checking bug in BPF verifier allowing memory corruption and escalation",
            "BPF vulnerability causing verifier crash without any privilege escalation now",
            "Exploit requiring specific BPF program structure not commonly encountered here",
            "CVE is patched on all kernel versions supporting BPF exploitation prevention"
        ]
    },
    {
        "q": "What is capability ambient set exploitation?",
        "o": [
            "Abusing ambient capabilities for privilege escalation across exec calls now here",
            "Ambient capabilities are restricted and cannot be exploited for escalation now",
            "Set exploitation requiring modification of process capability bounding set first",
            "Capabilities are validated before ambient inheritance preventing abuse attempts"
        ]
    },
    {
        "q": "What is CAP_SYS_ADMIN exploitation?",
        "o": [
            "Using sys admin capability for almost any administrative action including escape",
            "SYS_ADMIN capability is rarely granted providing no escalation opportunity here",
            "Admin exploitation requiring pre-existing root access for capability grant now",
            "System admin caps are restricted by namespaces preventing host access always"
        ]
    },
    {
        "q": "What is CAP_NET_ADMIN exploitation?",
        "o": [
            "Using network admin capability for network namespace escape or manipulation now",
            "NET_ADMIN capability only affects network without privilege escalation possible",
            "Admin exploitation requiring modification of network namespace configuration",
            "Network capabilities are isolated preventing any privilege escalation attacks"
        ]
    },
    {
        "q": "What is CAP_DAC_OVERRIDE exploitation?",
        "o": [
            "Using DAC override to bypass file permissions for reading sensitive files now here",
            "DAC override only applies to specific paths preventing full system access here",
            "Override exploitation requiring modification of file system ACL configuration",
            "Capability validates target paths preventing access to critical system files"
        ]
    },
    {
        "q": "What is CAP_DAC_READ_SEARCH exploitation?",
        "o": [
            "Using read search capability to access restricted files for information theft now",
            "Read search capability only affects empty directories without file access here",
            "Search exploitation requiring modification of directory permission settings now",
            "Capability is restricted to specific file types preventing broad access abuse"
        ]
    },
    {
        "q": "What is CAP_SETUID exploitation?",
        "o": [
            "Using setuid capability to change process UID for privilege escalation now here",
            "SETUID capability only works on processes owned by same user preventing abuse",
            "UID exploitation requiring modification of process namespace configuration now",
            "Capability validates target UID preventing arbitrary identity assumption here"
        ]
    },
    {
        "q": "What is CAP_SETGID exploitation?",
        "o": [
            "Using setgid capability to join privileged groups like docker or sudo for access",
            "SETGID capability is restricted preventing joining of privileged groups here now",
            "GID exploitation requiring modification of group membership database on system",
            "Capability validates target groups preventing access to privileged group list"
        ]
    },
    {
        "q": "What is CAP_CHOWN exploitation?",
        "o": [
            "Using chown capability to take ownership of privileged files for escalation now",
            "CHOWN capability only works on files owned by current user preventing abuse",
            "Ownership exploitation requiring modification of filesystem ownership database",
            "Capability validates target files preventing ownership of system critical files"
        ]
    },
    {
        "q": "What is CAP_FOWNER exploitation?",
        "o": [
            "Bypassing ownership checks to modify files owned by other users or root now here",
            "FOWNER capability is restricted to specific operations without full access now",
            "Owner exploitation requiring modification of process privilege level first here",
            "Capability validates operations preventing modification of protected files"
        ]
    },
    {
        "q": "What is CAP_MKNOD exploitation?",
        "o": [
            "Creating device nodes connecting to privileged block or character devices now",
            "MKNOD capability is restricted preventing connection to privileged devices here",
            "Node exploitation requiring modification of device manager configuration now",
            "Capability validates device major minor preventing privileged device access"
        ]
    },
    {
        "q": "What is CAP_SYS_PTRACE exploitation?",
        "o": [
            "Using ptrace capability to read or inject into any process for credential theft",
            "PTRACE capability only works on processes in same namespace preventing abuse",
            "Trace exploitation requiring modification of process security context first now",
            "Capability validates target processes preventing tracing of privileged daemons"
        ]
    },
    {
        "q": "What is CAP_SYS_MODULE exploitation?",
        "o": [
            "Loading kernel modules for rootkit installation and complete system control now",
            "SYS_MODULE capability is never granted to containers preventing exploitation",
            "Module exploitation requiring modification of module signing configuration here",
            "Capability validates modules before load preventing unsigned module insertion"
        ]
    },
    {
        "q": "What is CAP_SYS_RAWIO exploitation?",
        "o": [
            "Accessing raw device IO for direct hardware manipulation and kernel bypass now",
            "RAWIO capability only affects whitelisted devices without system access here now",
            "IO exploitation requiring modification of device access control list on system",
            "Capability validates IO targets preventing access to critical system devices"
        ]
    },
    {
        "q": "What is seccomp bypass techniques?",
        "o": [
            "Finding blocked syscalls alternatives or exploiting filter implementation bugs",
            "Seccomp filters cannot be bypassed once applied to process preventing escape",
            "Bypass requiring modification of seccomp profile before process start here now",
            "Security computing validates all syscall attempts preventing any bypass methods"
        ]
    },
    {
        "q": "What is seccomp notify exploitation?",
        "o": [
            "Exploiting seccomp user notification for race conditions or state confusion now",
            "Notify feature runs supervisor checks atomically preventing exploitation here",
            "Exploitation requiring modification of seccomp notification daemon settings now",
            "User notifications are validated preventing any race condition exploitation"
        ]
    },
    {
        "q": "What is Landlock bypass?",
        "o": [
            "Finding ways around Landlock filesystem restrictions for accessing blocked paths",
            "Landlock access rules cannot be bypassed once enforced preventing any escape",
            "Bypass requiring modification of Landlock ruleset before process execution now",
            "Filesystem restrictions validate all paths preventing any bypass attempts here"
        ]
    },
    {
        "q": "What is AppArmor profile bypass?",
        "o": [
            "Exploiting AppArmor profile gaps or vulnerabilities for unconfined execution now",
            "AppArmor profiles are complete and cannot be bypassed by confined processes",
            "Bypass requiring modification of AppArmor policy files on the system now here",
            "Application armor validates all access preventing any profile bypass attempts"
        ]
    },
    {
        "q": "What is SELinux bypass technique?",
        "o": [
            "Finding SELinux policy gaps or using allowed transitions for escalation now here",
            "SELinux policies are complete preventing any bypass by confined processes here",
            "Bypass requiring modification of SELinux policy database on the system now",
            "Security enhanced Linux validates all access preventing bypass exploits always"
        ]
    },
    {
        "q": "What is SELinux domain transition attack?",
        "o": [
            "Exploiting allowed domain transitions to reach more permissive context for access",
            "Domain transitions require explicit policy preventing unauthorized escalation",
            "Transition attack requiring modification of SELinux transition rules on host",
            "Context changes are validated preventing movement to unauthorized domains"
        ]
    },
    {
        "q": "What is Yama LSM bypass?",
        "o": [
            "Bypassing Yama ptrace restrictions through various techniques for process access",
            "Yama restrictions cannot be bypassed by unprivileged processes on the system",
            "Bypass requiring modification of Yama sysctl configuration settings on host",
            "Ptrace protection validates all attach requests preventing any bypass methods"
        ]
    },
    {
        "q": "What is TOMOYO bypass?",
        "o": [
            "Finding gaps in TOMOYO pathname based access control for restricted file access",
            "TOMOYO policies are learning based and complete preventing bypass by processes",
            "Bypass requiring modification of TOMOYO policy files in kernel configuration",
            "Access control validates all pathname requests preventing bypass exploits here"
        ]
    },
    {
        "q": "What is namespace escape via mount?",
        "o": [
            "Escaping mount namespace restrictions through bind mounts or mount propagation",
            "Mount namespaces are completely isolated preventing any escape to host system",
            "Escape requiring modification of mount namespace configuration on the host now",
            "Namespace validates all mount operations preventing escape to host filesystem"
        ]
    },
    {
        "q": "What is PID namespace escape?",
        "o": [
            "Escaping PID namespace to interact with or signal processes in host namespace",
            "PID isolation is complete preventing any interaction with host processes now",
            "Escape requiring modification of pid namespace configuration on host system",
            "Namespace validates all process operations preventing host namespace access"
        ]
    },
    {
        "q": "What is network namespace escape?",
        "o": [
            "Escaping network namespace to access host network or sniff host traffic now here",
            "Network isolation is complete preventing any access to host networking stack",
            "Escape requiring modification of network namespace configuration on host now",
            "Namespace validates all network operations preventing host network access"
        ]
    },
    {
        "q": "What is user namespace root mapping attack?",
        "o": [
            "Exploiting user namespace root mapping to create files owned by host root now",
            "User namespace root is mapped safely preventing any file ownership attacks here",
            "Attack requiring modification of user namespace mapping configuration on host",
            "Namespace validates all ID mappings preventing host root file manipulation"
        ]
    },
    {
        "q": "What is cgroup escape?",
        "o": [
            "Escaping cgroup restrictions to access resources outside container limits now here",
            "Cgroup isolation is complete preventing any escape to host resource access here",
            "Escape requiring modification of cgroup configuration on the host system now",
            "Control groups validate all resource access preventing escape to host system"
        ]
    },
    {
        "q": "What is cgroup v2 release_agent attack?",
        "o": [
            "Exploiting cgroup v2 release agent for code execution with host privileges now",
            "Cgroup v2 release agents require root and run with restricted privileges here",
            "Agent attack requiring modification of cgroup hierarchy on the host system now",
            "Release agents are validated before execution preventing privilege escalation"
        ]
    },
    {
        "q": "What is Docker socket escape?",
        "o": [
            "Using access to Docker socket to spawn privileged container for host access now",
            "Docker socket access does not provide any privilege escalation opportunity here",
            "Socket escape requiring modification of Docker daemon configuration on host",
            "Container runtime validates all requests preventing privileged container spawn"
        ]
    },
    {
        "q": "What is containerd escape?",
        "o": [
            "Exploiting containerd vulnerabilities for container escape to host system now here",
            "Container daemon runs with reduced privileges preventing any escape attacks here",
            "Escape requiring modification of containerd socket permissions on the system",
            "Runtime validates all operations preventing any container escape exploits now"
        ]
    },
    {
        "q": "What is CVE-2020-15257 containerd escape?",
        "o": [
            "Host network namespace containers can access containerd shim API for escape now",
            "Containerd vulnerability only causes container crash without host access here",
            "Escape requiring specific network namespace configuration not default on host",
            "CVE is patched on all supported containerd versions preventing exploitation now"
        ]
    },
    {
        "q": "What is runc escape?",
        "o": [
            "Exploiting runc vulnerabilities to escape container and access host system now here",
            "Container runtime runs in sandbox preventing any escape through exploitation",
            "Escape requiring modification of runc binary or configuration on host system",
            "Runtime validates all operations preventing container escape exploits always"
        ]
    },
    {
        "q": "What is CVE-2019-5736 runc escape?",
        "o": [
            "Overwriting host runc binary via proc fd to execute code on host as root now",
            "Runc vulnerability only affects container filesystem without host access here",
            "Escape requiring specific container configuration not common in production use",
            "CVE is patched on all supported runc versions preventing exploitation now here"
        ]
    },
    {
        "q": "What is CVE-2024-21626 runc escape?",
        "o": [
            "Working directory fd leak allowing container escape through proc filesystem access",
            "Runc vulnerability causing container crash without privilege escalation here now",
            "Escape requiring specific workdir configuration not present by default on host",
            "CVE is immediately patched and blocked by default seccomp preventing exploit"
        ]
    },
    {
        "q": "What is kata containers escape?",
        "o": [
            "Escaping kata containers micro VM for host access despite stronger isolation now",
            "Kata isolation is complete preventing any escape from micro virtual machine here",
            "Escape requiring modification of kata runtime configuration on host system now",
            "Container VM validates all operations preventing any escape to host system"
        ]
    },
    {
        "q": "What is gVisor escape?",
        "o": [
            "Escaping gVisor user space kernel to access host kernel or resources now here",
            "gVisor isolation is complete preventing any escape through user space kernel",
            "Escape requiring modification of gVisor sandbox configuration on host system",
            "User space kernel validates all syscalls preventing any host kernel access"
        ]
    },
    {
        "q": "What is Kubernetes pod escape?",
        "o": [
            "Breaking out of Kubernetes pod to access host or other pods in cluster now here",
            "Pod isolation is complete preventing any escape to host or other cluster pods",
            "Escape requiring modification of pod security policy or context on cluster now",
            "Cluster validates all pod requests preventing any pod escape exploits always"
        ]
    },
    {
        "q": "What is hostPath volume escape?",
        "o": [
            "Using hostPath volume mount to access and modify host filesystem from pod now",
            "HostPath volumes are read only and cannot be used for host modification here",
            "Volume escape requiring modification of pod volume mount configuration now here",
            "Kubernetes validates hostPath requests preventing access to sensitive paths"
        ]
    },
    {
        "q": "What is service account token theft?",
        "o": [
            "Stealing Kubernetes service account token for API access and cluster exploitation",
            "Service account tokens are encrypted and cannot be stolen from pod filesystem",
            "Token theft requiring modification of service account mount configuration now",
            "Cluster validates all token uses preventing exploitation through stolen tokens"
        ]
    },
    {
        "q": "What is kubelet API exploitation?",
        "o": [
            "Accessing kubelet API for running commands in pods or getting sensitive data now",
            "Kubelet API requires authentication preventing unauthorized command execution",
            "API exploitation requiring modification of kubelet authentication settings now",
            "Node agent validates all requests preventing unauthorized pod manipulation"
        ]
    },
    {
        "q": "What is etcd exploitation?",
        "o": [
            "Accessing etcd database for complete cluster secrets and configuration access now",
            "Etcd is encrypted at rest preventing any secret extraction from database here",
            "Database exploitation requiring network access to etcd endpoint on cluster now",
            "Cluster validates all etcd access preventing unauthorized database queries"
        ]
    },
    {
        "q": "What is kernel heap spray?",
        "o": [
            "Filling kernel heap with controlled objects to improve exploitation reliability now",
            "Kernel heap randomization prevents predictable object placement on all systems",
            "Spray requiring modification of kernel memory allocator configuration settings",
            "Heap protections validate object placement preventing spray based exploitation"
        ]
    },
    {
        "q": "What is cross-cache attack?",
        "o": [
            "Exploiting slab allocator cache crossing for use-after-free in different cache",
            "Cache separation prevents any cross cache exploitation on modern kernel now here",
            "Attack requiring modification of kernel slab allocator configuration on system",
            "Allocator validates cache access preventing cross cache object manipulation"
        ]
    },
    {
        "q": "What is msg_msg exploitation?",
        "o": [
            "Using message queue structures for kernel heap spray and arbitrary read write now",
            "Message structures are protected preventing use for exploitation attacks here",
            "Msg exploitation requiring modification of IPC subsystem configuration on host",
            "Kernel validates message operations preventing any exploitation through IPC"
        ]
    },
    {
        "q": "What is pipe_buffer exploitation?",
        "o": [
            "Using pipe buffer structures for flexible kernel object spray in exploits now here",
            "Pipe buffers are protected preventing use for kernel exploitation attacks here",
            "Buffer exploitation requiring modification of pipe subsystem configuration now",
            "Kernel validates pipe operations preventing any exploitation through buffers"
        ]
    },
    {
        "q": "What is sk_buff exploitation?",
        "o": [
            "Using socket buffer structures for network subsystem kernel exploitation now here",
            "Socket buffers are protected preventing use in privilege escalation attacks now",
            "Buff exploitation requiring modification of network stack configuration on host",
            "Kernel validates socket operations preventing any exploitation through buffers"
        ]
    },
    {
        "q": "What is seq_file exploitation?",
        "o": [
            "Using seq_file operations structure for kernel arbitrary read exploitation now",
            "Sequence files are protected preventing arbitrary read through seq operations",
            "File exploitation requiring modification of proc filesystem configuration now",
            "Kernel validates seq operations preventing any information disclosure attacks"
        ]
    },
    {
        "q": "What is setxattr heap spray?",
        "o": [
            "Using extended attributes for kernel heap spray with controlled content now here",
            "Xattr operations are limited preventing effective heap spray for exploitation",
            "Spray requiring modification of extended attribute size limits on filesystems",
            "Kernel validates xattr operations preventing use for heap spray attacks now"
        ]
    },
    {
        "q": "What is sendmsg kernel exploitation?",
        "o": [
            "Using sendmsg syscall for controlled kernel heap allocation in exploits now here",
            "Sendmsg allocations are restricted preventing use for kernel exploitation here",
            "Msg exploitation requiring modification of socket subsystem configuration now",
            "Kernel validates message operations preventing any exploitation through IPC"
        ]
    },
    {
        "q": "What is timerfd exploitation?",
        "o": [
            "Using timer file descriptors for kernel object spray in exploitation attacks now",
            "Timer fd objects are protected preventing use for kernel exploitation here now",
            "FD exploitation requiring modification of timer subsystem configuration on host",
            "Kernel validates timer operations preventing any exploitation through timerfds"
        ]
    },
    {
        "q": "What is signalfd exploitation?",
        "o": [
            "Using signal file descriptors for kernel heap manipulation in exploits now here",
            "Signal fd objects are restricted preventing use in exploitation attacks here now",
            "FD exploitation requiring modification of signal subsystem configuration now",
            "Kernel validates signal operations preventing any exploitation through fds"
        ]
    },
    {
        "q": "What is eventfd exploitation?",
        "o": [
            "Using event file descriptors for kernel object manipulation in exploits now here",
            "Event fd objects are protected preventing use for kernel exploitation attacks",
            "FD exploitation requiring modification of event subsystem configuration on host",
            "Kernel validates event operations preventing any exploitation through eventfds"
        ]
    },
    {
        "q": "What is epoll exploitation?",
        "o": [
            "Using epoll structures for kernel heap manipulation in privilege exploits now",
            "Epoll objects are protected preventing use for kernel exploitation attacks here",
            "Poll exploitation requiring modification of event polling configuration on host",
            "Kernel validates epoll operations preventing any exploitation through polling"
        ]
    },
    {
        "q": "What is inotify exploitation?",
        "o": [
            "Using inotify structures for kernel heap spray in exploitation attacks now here",
            "Inotify objects are restricted preventing effective heap spray for exploits",
            "Notify exploitation requiring modification of filesystem watch configuration",
            "Kernel validates inotify operations preventing any exploitation through watches"
        ]
    },
    {
        "q": "What is fanotify exploitation?",
        "o": [
            "Using fanotify for kernel heap manipulation or privilege escalation attacks now",
            "Fanotify requires CAP_SYS_ADMIN preventing unprivileged exploitation here now",
            "Notify exploitation requiring modification of filesystem monitoring settings",
            "Kernel validates fanotify operations preventing any exploitation attempts now"
        ]
    },
    {
        "q": "What is keyctl exploitation?",
        "o": [
            "Using keyring operations for kernel heap spray and exploitation attacks now here",
            "Keyctl operations are rate limited preventing effective exploitation through keys",
            "Key exploitation requiring modification of keyring subsystem configuration now",
            "Kernel validates keyring operations preventing any exploitation through keys"
        ]
    },
    {
        "q": "What is add_key spray?",
        "o": [
            "Using add_key syscall for controlled kernel heap allocation in exploits now here",
            "Key addition is rate limited preventing effective spray for exploitation here",
            "Spray requiring modification of keyring quota limits on the system for attack",
            "Kernel validates key operations preventing use for heap spray based attacks"
        ]
    },
    {
        "q": "What is bpf map exploitation?",
        "o": [
            "Using BPF maps for kernel memory manipulation in exploitation attacks now here",
            "BPF maps are protected preventing arbitrary memory access through map operations",
            "Map exploitation requiring modification of BPF verifier to allow unsafe access",
            "Kernel validates all map operations preventing any exploitation attempts now"
        ]
    },
    {
        "q": "What is KASLR bypass technique?",
        "o": [
            "Finding kernel base address through information leaks to defeat randomization",
            "KASLR cannot be bypassed without existing kernel vulnerability exploitation now",
            "Bypass requiring modification of kernel ASLR entropy on the system for attack",
            "Kernel validates all address operations preventing any KASLR leak exploits"
        ]
    },
    {
        "q": "What is stack pivoting in kernel exploitation?",
        "o": [
            "Moving kernel stack to controlled memory region for ROP chain execution now",
            "Stack cannot be pivoted due to stack canary and guard page protections here",
            "Pivoting requiring pre-existing arbitrary write primitive in kernel exploit",
            "Kernel validates stack pointer preventing any stack pivot based attacks now"
        ]
    },
    {
        "q": "What is ret2usr in kernel exploitation?",
        "o": [
            "Returning to user space code from kernel context for arbitrary code execution",
            "SMEP and SMAP prevent kernel executing or accessing user space memory now here",
            "Return exploitation requiring disabling of CPU protection features for attack",
            "Kernel validates return addresses preventing any return to user space attacks"
        ]
    },
    {
        "q": "What is kCFI bypass?",
        "o": [
            "Bypassing kernel control flow integrity for forward edge exploit execution now",
            "KCFI cannot be bypassed without finding valid type matching gadgets in kernel",
            "Bypass requiring modification of kernel CFI configuration for attack on system",
            "Control flow is validated preventing any bypass attempts through type confusion"
        ]
    },
    {
        "q": "What is FG-KASLR bypass?",
        "o": [
            "Bypassing fine grained KASLR through information leaks or timing side channels",
            "FG-KASLR randomizes every function preventing bypass through single address leak",
            "Bypass requiring modification of kernel randomization entropy for exploitation",
            "Kernel validates address space preventing any fine grained KASLR bypass now"
        ]
    },
    {
        "q": "What is KPTI bypass?",
        "o": [
            "Bypassing kernel page table isolation to access kernel memory from user space now",
            "KPTI completely separates page tables preventing any bypass from user space here",
            "Bypass requiring modification of page table switching on the system for attack",
            "Kernel validates page table access preventing any KPTI bypass attempts always"
        ]
    },
    {
        "q": "What is slab freelist randomization bypass?",
        "o": [
            "Predicting slab freelist order for reliable object reclamation in exploits now",
            "Freelist randomization prevents prediction of object allocation order always",
            "Bypass requiring modification of slab allocator configuration for exploitation",
            "Kernel validates freelist operations preventing any prediction based attacks"
        ]
    },
    {
        "q": "What is hardened usercopy bypass?",
        "o": [
            "Bypassing usercopy protections for kernel buffer overflow exploitation now here",
            "Usercopy validation cannot be bypassed preventing any buffer overflow exploits",
            "Bypass requiring modification of usercopy whitelist on the system for attack",
            "Kernel validates all user copy operations preventing any bypass attempts now"
        ]
    },
    {
        "q": "What is struct randomization bypass?",
        "o": [
            "Finding structure layout through leaks or symbols for exploitation despite randomization",
            "Structure randomization changes layout per build preventing reliable exploitation",
            "Bypass requiring access to kernel symbols or debug information for offset calculation",
            "Kernel validates structure access preventing any bypass through layout prediction"
        ]
    },
    {
        "q": "What is shadow stack bypass?",
        "o": [
            "Bypassing CET shadow stack protection for kernel ROP exploitation now here",
            "Shadow stack cannot be bypassed preventing any return address manipulation now",
            "Bypass requiring modification of shadow stack configuration on the system for attack",
            "Kernel validates return addresses against shadow stack preventing all ROP attacks"
        ]
    },
    {
        "q": "What is IBT bypass?",
        "o": [
            "Bypassing indirect branch tracking for forward edge control flow hijacking now",
            "IBT validates all indirect branches preventing any control flow hijacking exploits",
            "Bypass requiring modification of indirect branch configuration for attack now",
            "Kernel validates branch targets preventing any IBT bypass through gadgets"
        ]
    },
    {
        "q": "What is speculative execution attack?",
        "o": [
            "Using CPU speculative execution to leak kernel memory through side channels now",
            "Speculation attacks are mitigated preventing any kernel memory leakage here now",
            "Attack requiring modification of CPU microcode to enable speculative leaks now",
            "Kernel validates speculative paths preventing any side channel leakage attacks"
        ]
    },
    {
        "q": "What is Spectre variant in kernel?",
        "o": [
            "Using Spectre for kernel address leakage or cross privilege information disclosure",
            "Spectre is fully mitigated on modern kernels preventing any exploitation here now",
            "Attack requiring specific CPU vulnerable to Spectre variants not patched now",
            "Kernel validates speculative execution preventing all Spectre based leakage"
        ]
    },
    {
        "q": "What is MDS attack in kernel?",
        "o": [
            "Using microarchitectural data sampling for kernel memory leakage attacks now here",
            "MDS is fully mitigated preventing any kernel memory leakage through sampling",
            "Attack requiring specific CPU vulnerable to MDS without microcode patches now",
            "Kernel clears microarchitectural buffers preventing all MDS based leakage"
        ]
    },
    {
        "q": "What is kernel UAF exploitation?",
        "o": [
            "Exploiting kernel use-after-free by reclaiming freed object with controlled data",
            "UAF exploitation is prevented by object isolation in kernel memory allocator now",
            "Exploitation requiring triggering specific allocation pattern for object reclaim",
            "Kernel validates object lifetime preventing any use-after-free exploitation now"
        ]
    },
    {
        "q": "What is kernel double free exploitation?",
        "o": [
            "Exploiting double free to corrupt allocator state for arbitrary write primitive now",
            "Double free is detected by kernel allocator preventing any exploitation now here",
            "Exploitation requiring specific allocation pattern to avoid detection by allocator",
            "Kernel validates all free operations preventing any double free exploitation"
        ]
    },
    {
        "q": "What is kernel type confusion?",
        "o": [
            "Treating kernel object as different type for field access and control flow hijack",
            "Type confusion is prevented by kernel object type validation on access now here",
            "Confusion requiring specific allocation to place different object at same address",
            "Kernel validates object types preventing any type confusion exploitation now"
        ]
    },
    {
        "q": "What is kernel race condition exploitation?",
        "o": [
            "Exploiting time-of-check-time-of-use races in kernel for privilege escalation now",
            "Race conditions are prevented by proper locking in all kernel operations here",
            "Exploitation requiring precise timing to win race against kernel validation check",
            "Kernel serializes all operations preventing any race condition exploitation now"
        ]
    },
    {
        "q": "What is kernel integer overflow?",
        "o": [
            "Exploiting integer overflow in kernel for heap corruption or incorrect size calc now",
            "Integer overflows are prevented by compiler instrumentation in modern kernels",
            "Overflow requiring specific input triggering arithmetic overflow in size calculation",
            "Kernel validates all arithmetic operations preventing integer overflow exploits"
        ]
    },
    {
        "q": "What is kernel off-by-one exploitation?",
        "o": [
            "Exploiting off-by-one errors in kernel for adjacent object corruption attacks now",
            "Off-by-one errors are prevented by bounds checking in all kernel operations here",
            "Exploitation requiring same cache adjacent object allocation for corruption now",
            "Kernel validates all bounds preventing any off-by-one based exploitation now"
        ]
    },
    {
        "q": "What is kernel information leak exploitation?",
        "o": [
            "Using kernel info leaks to bypass KASLR or obtain exploitation primitives now",
            "Information leaks are prevented by memory clearing in kernel operations here",
            "Leak requiring specific syscall or interface exposing uninitialized kernel memory",
            "Kernel validates all output preventing any information disclosure to users"
        ]
    },
    {
        "q": "What is uninitialized kernel memory read?",
        "o": [
            "Reading uninitialized kernel stack or heap for information disclosure attacks now",
            "Uninitialized reads are prevented by clearing in kernel memory allocations here",
            "Read requiring specific path triggering allocation without full initialization now",
            "Kernel zero-initializes all memory preventing uninitialized data disclosure"
        ]
    },
    {
        "q": "What is privilege escalation chain?",
        "o": [
            "Combining multiple vulnerabilities for complete privilege escalation to root now",
            "Chaining is prevented by defense in depth blocking any component exploitation",
            "Chain requiring finding compatible vulnerabilities in same kernel version now here",
            "Kernel defenses are independent preventing any exploitation chain completion"
        ]
    },
    {
        "q": "What is kernel rootkit techniques?",
        "o": [
            "Hiding processes files and network connections through kernel level modifications",
            "Rootkits require module loading which is blocked on hardened kernel configurations",
            "Techniques requiring exploitation of kernel structure for persistent modification",
            "Kernel validates all lookups preventing any hiding through table modification now"
        ]
    },
    {
        "q": "What is direct syscall table modification?",
        "o": [
            "Overwriting syscall table entries for complete system call interception and backdoors",
            "Syscall table is read only and protected against modification by any process now",
            "Modification requiring write access to kernel memory through existing exploit now",
            "Kernel validates syscall dispatch preventing any table modification attacks here"
        ]
    },
    {
        "q": "What is IDT hooking?",
        "o": [
            "Modifying interrupt descriptor table for interrupt interception and code execution",
            "IDT is protected against modification preventing any interrupt hooking attacks",
            "Hooking requiring write access to kernel memory for descriptor modification now",
            "Kernel validates interrupt dispatch preventing any IDT modification exploits"
        ]
    },
    {
        "q": "What is VFS hooking?",
        "o": [
            "Hooking virtual filesystem operations for file hiding and access interception now",
            "VFS operations are protected preventing any hooking by non-root processes here",
            "Hooking requiring module loading or kernel exploit for operation table modification",
            "Kernel validates filesystem operations preventing any VFS hooking attacks now"
        ]
    },
    {
        "q": "What is netfilter hooking?",
        "o": [
            "Adding netfilter hooks for network traffic interception and manipulation attacks now",
            "Netfilter hooks require CAP_NET_ADMIN preventing unprivileged hook installation",
            "Hooking requiring root access for netfilter hook registration on the system now",
            "Kernel validates network hooks preventing any unauthorized traffic interception"
        ]
    },
    {
        "q": "What is kernel text modification?",
        "o": [
            "Modifying kernel code text for persistent backdoor installation in running kernel",
            "Kernel text is read only and protected against modification by any process here",
            "Modification requiring kernel exploit with write primitive for text patching now",
            "Kernel validates code integrity preventing any text section modification attacks"
        ]
    },
    {
        "q": "What is live kernel patching exploitation?",
        "o": [
            "Exploiting live patching infrastructure for malicious kernel code modification now",
            "Live patching requires signed patches preventing any unauthorized modification here",
            "Exploitation requiring access to kernel patching interface for patch injection now",
            "Kernel validates all patches cryptographically preventing malicious patch loading"
        ]
    },
    {
        "q": "What is credential structure modification?",
        "o": [
            "Directly modifying task credential structure for privilege escalation in kernel now",
            "Credentials are protected by RCU and read only preventing direct modification here",
            "Modification requiring arbitrary kernel write primitive for cred structure access",
            "Kernel validates credential access preventing any direct structure modification"
        ]
    },
    {
        "q": "What is task struct modification?",
        "o": [
            "Modifying task struct fields for privilege escalation or process manipulation now",
            "Task structures are protected preventing modification by non-kernel code here now",
            "Modification requiring arbitrary kernel write for task structure field access now",
            "Kernel validates task access preventing any unauthorized structure modification"
        ]
    },
    {
        "q": "What is modprobe userhelper exploitation?",
        "o": [
            "Triggering modprobe execution with controlled path for root code execution now here",
            "Modprobe path is protected and requires root to modify on the system currently",
            "Exploitation requiring arbitrary kernel write to change modprobe_path variable now",
            "Kernel validates binary path preventing any malicious modprobe execution attacks"
        ]
    },
    {
        "q": "What is poweroff_cmd exploitation?",
        "o": [
            "Modifying poweroff command path for code execution on shutdown trigger now here",
            "Poweroff path requires kernel write preventing exploitation from user space here",
            "Exploitation requiring arbitrary write to kernel orderly poweroff variables now",
            "Kernel validates shutdown command preventing malicious command substitution"
        ]
    },
    {
        "q": "What is kernel debugging interface exploitation?",
        "o": [
            "Using kernel debug interfaces for arbitrary read write or code execution now here",
            "Debug interfaces are disabled in production kernels preventing exploitation here",
            "Exploitation requiring access to debugfs or kgdb enabled kernel for attack now",
            "Kernel restricts debug access preventing any exploitation through debug interfaces"
        ]
    },
    {
        "q": "What is proc file exploitation?",
        "o": [
            "Exploiting proc filesystem entries for information disclosure or kernel access now",
            "Proc files are protected with proper permissions preventing unauthorized access",
            "Exploitation requiring specific vulnerable proc entry for kernel exploitation now",
            "Kernel validates proc access preventing any exploitation through proc interface"
        ]
    },
    {
        "q": "What is sysfs exploitation?",
        "o": [
            "Exploiting sysfs entries for device control or kernel parameter modification now",
            "Sysfs entries are protected by proper permissions preventing modifications here",
            "Exploitation requiring writable sysfs entry with exploitable functionality now here",
            "Kernel validates sysfs writes preventing any exploitation through sysfs interface"
        ]
    },
    {
        "q": "What is debugfs exploitation?",
        "o": [
            "Using debugfs for kernel internals access or exploitation in development kernels",
            "Debugfs is mounted with restricted access preventing exploitation by users here",
            "Exploitation requiring debugfs mount with accessible exploitable entries on system",
            "Kernel restricts debugfs access preventing any exploitation through debug files"
        ]
    },
    {
        "q": "What is configfs exploitation?",
        "o": [
            "Using configfs for kernel subsystem configuration exploitation on the system now",
            "Configfs requires elevated privileges preventing unprivileged exploitation here",
            "Exploitation requiring specific configfs subsystem with exploitable interface now",
            "Kernel validates configfs operations preventing any exploitation through config"
        ]
    },
    {
        "q": "What is tracefs exploitation?",
        "o": [
            "Using tracefs for kernel tracing access or hook installation on system now here",
            "Tracefs requires root access preventing unprivileged tracing exploitation here",
            "Exploitation requiring tracefs access with tracing enabled on production kernel",
            "Kernel restricts trace access preventing any exploitation through trace files"
        ]
    },
    {
        "q": "What is pstore exploitation?",
        "o": [
            "Using persistent storage for kernel memory forensics or crash data access now here",
            "Pstore requires elevated privileges preventing unprivileged data access on system",
            "Exploitation requiring pstore mount with accessible crash data on the system now",
            "Kernel restricts pstore access preventing unauthorized crash data disclosure"
        ]
    },
    {
        "q": "What is null dereference exploitation?",
        "o": [
            "Exploiting kernel null pointer dereference with mapped zero page for escalation",
            "Mmap_min_addr prevents mapping zero page blocking null dereference exploits now",
            "Exploitation requiring kernel vulnerable to null dereference with zero page access",
            "Kernel validates all pointer access preventing null dereference exploitation now"
        ]
    },
    {
        "q": "What is kernel symbolic link attack?",
        "o": [
            "Using symbolic links to race kernel file operations for privilege escalation now",
            "Kernel follows symlinks safely preventing any symlink based race attacks here now",
            "Attack requiring specific vulnerable kernel operation following user symlinks now",
            "Kernel validates symlink targets preventing any symlink based exploitation now"
        ]
    },
    {
        "q": "What is arbitrary file read through kernel?",
        "o": [
            "Exploiting kernel bugs to read arbitrary files regardless of permissions now here",
            "File permissions are enforced in kernel preventing any bypass through bugs here",
            "Read requiring kernel vulnerability bypassing VFS permission checking for access",
            "Kernel validates all file access preventing any permission bypass exploits now"
        ]
    },
    {
        "q": "What is arbitrary file write through kernel?",
        "o": [
            "Exploiting kernel vulnerabilities to write arbitrary files for root access now here",
            "File write permissions are enforced preventing any bypass through kernel bugs",
            "Write requiring kernel vulnerability bypassing VFS permission enforcement now",
            "Kernel validates all write operations preventing any unauthorized file writes"
        ]
    },
    {
        "q": "What is forensic evidence destruction?",
        "o": [
            "Techniques to destroy or modify forensic evidence after exploitation on system now",
            "Evidence destruction is detected by integrity monitoring preventing hiding here",
            "Destruction requiring root access to modify logs and forensic artifacts on system",
            "Kernel logs all operations preventing any complete evidence destruction attempts"
        ]
    },
    {
        "q": "What is log tampering for evasion?",
        "o": [
            "Modifying system logs to hide exploitation evidence and maintain persistence now",
            "Log tampering is detected by remote logging and integrity verification systems",
            "Tampering requiring root access to modify local log files after exploitation now",
            "Kernel protects logs preventing any modification by non-root processes on system"
        ]
    },
    {
        "q": "What is timestamp modification?",
        "o": [
            "Modifying file timestamps to hide malicious file creation or modification times now",
            "Timestamps are protected and cannot be modified after file creation on system here",
            "Modification requiring specific tools to change atime mtime ctime of files now",
            "Kernel logs timestamp changes preventing any evidence hiding through modification"
        ]
    },
    {
        "q": "What is history file manipulation?",
        "o": [
            "Modifying or clearing shell history files to hide executed commands now here today",
            "History files are protected preventing modification by non-owner processes now",
            "Manipulation requiring access to user home directory for history file modification",
            "Shell logs commands to remote system preventing local history tampering attacks"
        ]
    },
    {
        "q": "What is process hiding techniques?",
        "o": [
            "Hiding malicious processes from ps and top through various evasion techniques now",
            "Process hiding is prevented by kernel integrity preventing proc manipulation here",
            "Techniques requiring root or kernel access for effective process hiding on system",
            "Kernel exposes all processes preventing any complete hiding from administrators"
        ]
    },
    {
        "q": "What is network connection hiding?",
        "o": [
            "Hiding malicious network connections from netstat and ss through various methods",
            "Connection hiding requires kernel modification preventing user space hiding here",
            "Hiding requiring root access or netfilter manipulation for connection concealment",
            "Kernel exposes all connections preventing complete hiding from network analysis"
        ]
    },
    {
        "q": "What is file hiding techniques?",
        "o": [
            "Hiding malicious files from directory listing through various evasion methods now",
            "File hiding requires filesystem modification preventing user space hiding here now",
            "Techniques requiring root or extended attribute manipulation for file concealment",
            "Kernel exposes all files preventing any complete hiding from file system analysis"
        ]
    },
    {
        "q": "What is memory only malware?",
        "o": [
            "Running malicious code entirely in memory without touching disk for forensics evasion",
            "Memory resident malware is detected by memory forensics tools on the system now here",
            "Malware requiring exploitation to inject and maintain code in process memory space",
            "Kernel monitors memory operations preventing any undetected memory resident code"
        ]
    },
    {
        "q": "What is living off the land?",
        "o": [
            "Using legitimate system tools for exploitation to avoid detection by security tools",
            "LOL techniques are detected by behavior based monitoring and anomaly detection now",
            "Techniques requiring knowledge of legitimate tools usable for malicious purposes",
            "Security tools block all system tool execution preventing LOL based attacks here"
        ]
    },
    {
        "q": "What is reverse shell evasion?",
        "o": [
            "Techniques to hide reverse shell traffic from network monitoring and detection now",
            "Reverse shells are always detected by network monitoring regardless of evasion here",
            "Evasion requiring encryption or protocol tunneling for reverse shell concealment now",
            "Network security blocks all outbound connections preventing reverse shell attacks"
        ]
    },
    {
        "q": "What is DNS tunneling for exfiltration?",
        "o": [
            "Using DNS queries and responses to tunnel data or commands through firewalls now",
            "DNS tunneling is always detected by DNS monitoring and analysis systems on network",
            "Tunneling requiring DNS infrastructure under attacker control for data exfiltration",
            "Network security inspects all DNS traffic preventing any tunneling attempts here"
        ]
    },
    {
        "q": "What is ICMP tunneling?",
        "o": [
            "Using ICMP echo requests and replies for command and control communication now here",
            "ICMP tunneling is detected by deep packet inspection preventing covert channels",
            "Tunneling requiring custom ICMP payload encoding for command communication now here",
            "Network security blocks all ICMP traffic preventing any tunneling attempts always"
        ]
    },
    {
        "q": "What is HTTP tunneling for C2?",
        "o": [
            "Encoding command and control traffic within legitimate HTTP requests and responses",
            "HTTP tunneling is always detected by web application firewalls on the network now",
            "Tunneling requiring custom HTTP header encoding for command communication here now",
            "Network security terminates all HTTP connections preventing tunneling attempts"
        ]
    },
    {
        "q": "What is websocket tunneling?",
        "o": [
            "Using websocket connections for persistent command and control channel establishment",
            "Websocket tunneling is detected by network monitoring preventing covert channels",
            "Tunneling requiring websocket server infrastructure for persistent communication",
            "Network security blocks all websocket connections preventing tunneling attacks"
        ]
    },
    {
        "q": "What is SSL/TLS inspection bypass?",
        "o": [
            "Techniques to avoid TLS inspection for encrypted command and control channels now",
            "TLS inspection cannot be bypassed on properly configured network infrastructure",
            "Bypass requiring certificate pinning or custom TLS configuration for evasion",
            "Network security decrypts all TLS traffic preventing any inspection bypass now"
        ]
    },
    {
        "q": "What is proxy aware implant?",
        "o": [
            "Malware that detects and uses proxy settings for command and control communication",
            "Proxy aware implants are detected by proxy authentication requirements always now",
            "Implant requiring proxy configuration discovery for network egress in corporate env",
            "Network security blocks all proxy connections from unknown applications always"
        ]
    },
    {
        "q": "What is domain fronting?",
        "o": [
            "Using CDN to hide true destination of C2 traffic behind legitimate domains now here",
            "Domain fronting is blocked by all major CDN providers preventing its use now today",
            "Fronting requiring CDN account and specific CDN configuration for traffic routing",
            "Network security inspects all CDN traffic preventing any domain fronting attempts"
        ]
    },
    {
        "q": "What is dead drop resolver?",
        "o": [
            "Using legitimate services to host C2 configuration or commands for retrieval now",
            "Dead drop resolvers are monitored and blocked preventing their use by malware now",
            "Resolver requiring legitimate service abuse for hosting command configuration data",
            "Network security blocks access to all paste sites preventing dead drop usage"
        ]
    },
    {
        "q": "What is cloud C2 infrastructure?",
        "o": [
            "Using cloud services for command and control to blend with legitimate traffic now",
            "Cloud C2 is detected by cloud provider security preventing malicious use here now",
            "Infrastructure requiring cloud account and API configuration for C2 operation",
            "Network security blocks all cloud API traffic preventing cloud C2 establishment"
        ]
    },
    {
        "q": "What is beaconing detection evasion?",
        "o": [
            "Techniques to randomize callback intervals and avoid detection of regular patterns",
            "Beaconing is detected regardless of timing randomization by network monitoring now",
            "Evasion requiring jitter and variable sleep times to avoid pattern detection here",
            "Network security detects all outbound callbacks preventing beaconing activity"
        ]
    },
    {
        "q": "What is traffic blending?",
        "o": [
            "Making malicious traffic appear similar to legitimate application network behavior",
            "Traffic blending is detected by deep packet inspection and behavior analysis now",
            "Blending requiring mimicry of legitimate protocol behavior for evasion purposes",
            "Network security blocks all traffic not matching exact protocol specifications"
        ]
    }
]